[{"IDS": ["af427241-f036-454d-9717-2c8b95bbd1bd"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974709939"], "Names": ["Chainsaw Man, Vol. 1 - Chainsaw Man 1 (Paperback)"], "Authors": ["Tatsuki Fujimoto"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Broke young man + chainsaw dog demon = Chainsaw Man!\n\nDenji was a small-time devil hunter just trying to survive in a harsh world. After being killed on a job, he is revived by his pet devil Pochita and becomes something new and dangerous-Chainsaw Man!\n\nDenji's a poor young man who'll do anything for money, even hunting down devils with his pet devil-dog Pochita. He's a simple man with simple dreams, drowning under a mountain of debt. But his sad life gets turned upside down one day when he's betrayed by someone he trusts. Now with the power of a devil inside him, Denji's become a whole new man-Chainsaw Man!"]}, {"IDS": ["15f95dd5-494c-4948-b239-80f61e4090d5"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974707126"], "Names": ["Komi Can't Communicate, Vol. 1 - Komi Can't Communicate 1 (Paperback)"], "Authors": ["Tomohito Oda"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["The journey to 100 friends begins with a single conversation.\n\nSocially anxious high school student Shoko Komi's greatest dream is to make some friends, but everyone at school mistakes her crippling social anxiety for cool reserve! With the whole student body keeping their distance and Komi unable to utter a single word, friendship might be forever beyond her reach.\n\nTimid Tadano is a total wallflower, and that's just the way he likes it. But all that changes when he finds himself alone in a classroom on the first day of high school with the legendary Komi. He quickly realizes she isn't aloof-she's just super awkward. Now he's made it his mission to help her on her quest to make 100 friends!"]}, {"IDS": ["e30f8e47-9045-4dbc-9715-378fe04251a0"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781975344382"], "Names": ["Solo Leveling, Vol. 5 (Paperback)"], "Authors": ["Chugong"], "Publishers": ["Little, Brown & Company"], "Book_Formats": ["Paperback"], "Descriptions": ["Jinwoo knows it won't be long before his true power fully comes to light and the guilds\nand association of Korea descend upon him, seeking his allegiance. Since his training\nhas thus far been a solo endeavor, Jinwoo decides he ought to at least see what an\nA-rank raid is really like. Joining the Hunters' excavation team is the perfect\nopportunity to assess a high-level guild in action, even if his role is limited to hauling\nand mining. That is, until a particularly nasty dungeon boss requires the luggage\ncarrier to step up to carry the team as well!!"]}, {"IDS": ["63671c05-20fd-4ddb-9053-9fe6122ba009"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974717279"], "Names": ["Chainsaw Man, Vol. 4 - Chainsaw Man 4 (Paperback)"], "Authors": ["Tatsuki Fujimoto"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Broke young man + chainsaw dog demon = Chainsaw Man!\n\nDenji was a small-time devil hunter just trying to survive in a harsh world. After being killed on a job, he is revived by his pet devil Pochita and becomes something new and dangerous-Chainsaw Man!\n\nDevil Extermination Special Division 4 is in serious trouble as a devil has sent a whole team of assassins to take Denji's heart. In order to survive the onslaught, Denji, Power and Aki will have to get stronger. But is Denji smart enough to learn how to control his devil powers? Can you can teach an old chainsaw-dog-devil new tricks?"]}, {"IDS": ["a6abc358-9f29-4d87-a1d9-37b54795b14d"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974719228"], "Names": ["Chainsaw Man, Vol. 5 - Chainsaw Man 5 (Paperback)"], "Authors": ["Tatsuki Fujimoto"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Broke young man + chainsaw dog demon = Chainsaw Man!\n\nDenji was a small-time devil hunter just trying to survive in a harsh world. After being killed on a job, he is revived by his pet devil Pochita and becomes something new and dangerous-Chainsaw Man!\n\nIt's Chainsaw vs. Sword as the bloody battle for Denji's heart heats up. Denji is going to have to pull out all the stops against this crafty opponent. And when the dust settles, how will Special Division 4 move on from their losses?"]}, {"IDS": ["12292946-4ca3-43cf-bec6-6aa259ab6958"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781569319017"], "Names": ["One Piece, Vol. 1 - One Piece 1 (Paperback)"], "Authors": ["Eiichiro Oda"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Join Monkey D. Luffy and his swashbuckling crew in their search for the ultimate treasure, One Piece!\n\nAs a child, Monkey D. Luffy dreamed of becoming King of the Pirates. But his life changed when he accidentally gained the power to stretch like rubber...at the cost of never being able to swim again! Years, later, Luffy sets off in search of the \"One Piece,\" said to be the greatest treasure in the world...\n\nAs a child, Monkey D. Luffy was inspired to become a pirate by listening to the tales of the buccaneer \"Red-Haired\" Shanks. But his life changed when Luffy accidentally ate the Gum-Gum Devil Fruit and gained the power to stretch like rubber...at the cost of never being able to swim again! Years later, still vowing to become the king of the pirates, Luffy sets out on his adventure...one guy alone in a rowboat, in search of the legendary \"One Piece,\" said to be the greatest treasure in the world..."]}, {"IDS": ["b6fd6564-f914-42e3-8cc5-bb55c79203d9"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974715466"], "Names": ["Spy x Family, Vol. 1 - Spy x Family 1 (Paperback)"], "Authors": ["Tatsuya Endo"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["An action-packed comedy about a fake family that includes a spy, an assassin and a telepath!\n\nMaster spy Twilight is unparalleled when it comes to going undercover on dangerous missions for the betterment of the world. But when he receives the ultimate assignment-to get married and have a kid-he may finally be in over his head!\n\nNot one to depend on others, Twilight has his work cut out for him procuring both a wife and a child for his mission to infiltrate an elite private school. What he doesn't know is that the wife he's chosen is an assassin and the child he's adopted is a telepath!"]}, {"IDS": ["f3d49dbd-f3ef-48da-9bdc-31122f9f6e7b"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974727117"], "Names": ["Chainsaw Man, Vol. 11 - Chainsaw Man 11 (Paperback)"], "Authors": ["Tatsuki Fujimoto"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Broke young man + chainsaw demon = Chainsaw Man!\n\nDenji was a small-time devil hunter just trying to survive in a harsh world. After being killed on a job, he is revived by his pet devil Pochita and becomes something new and dangerous-Chainsaw Man!\n\nChainsaw Man has escaped Makima's attempts to control him so far, but she now reveals the full extent of her plans. Denji will need the help of his remaining friends if he is to have any chance of defeating Makima in their final confrontation!"]}, {"IDS": ["8c89d97b-ca13-49a7-9d09-4a6dfdab5983"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421582696"], "Names": ["My Hero Academia, Vol. 1 - My Hero Academia 1 (Paperback)"], "Authors": ["Kohei Horikoshi"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["What would the world be like if 80 percent of the population manifested superpowers called Quirks at age four? Heroes and villains would be battling it out everywhere! Being a hero would mean learning to use your power, but where would you go to study? The Hero Academy of course! But what would you do if you were one of the 20 percent who were born Quirkless?\n\nMiddle school student Izuku Midoriya wants to be a hero more than anything, but he hasn't got an ounce of power in him. With no chance of ever getting into the prestigious U.A. High School for budding heroes, his life is looking more and more like a dead end. Then an encounter with All Might, the greatest hero of them all, gives him a chance to change his destiny..."]}, {"IDS": ["22cf70ac-fbed-42f2-ad8e-40ae053f9175"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781975332877"], "Names": ["Toilet-bound Hanako-kun, Vol. 1 (Paperback)"], "Authors": ["Aidalro"], "Publishers": ["Little, Brown & Company"], "Book_Formats": ["Paperback"], "Descriptions": ["'Hanako-san, Hanako-san... are you there?'\nAt Kamome Academy, rumors abound about the school's Seven Mysteries, one of which is Hanako-san. Said to occupy the third stall of the third floor girls' bathroom in the old school building, Hanako-san grants any wish when summoned. Nene Yashiro, an occult-loving high school girl who dreams of romance, ventures into this haunted bathroom... but the Hanako-san she meets there is nothing like she imagined! Kamome Academy's Hanako-san...is a boy!"]}, {"IDS": ["5211ea24-7c26-44b6-a966-e00620f1b1dc"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974709946"], "Names": ["Chainsaw Man, Vol. 2 - Chainsaw Man 2 (Paperback)"], "Authors": ["Tatsuki Fujimoto"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Broke young man + chainsaw dog demon = Chainsaw Man!\n\nDenji was a small-time devil hunter just trying to survive in a harsh world. After being killed on a job, he is revived by his pet devil Pochita and becomes something new and dangerous-Chainsaw Man!\n\nIn order to achieve the greatest goal in human history-to touch a boob-Denji will risk everything in a fight against the dangerous Bat Devil. But will getting what he wants actually make him happy...?"]}, {"IDS": ["e3118e87-aac8-40eb-9bfe-3c0caac2089a"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974725359"], "Names": ["Chainsaw Man, Vol. 10 - Chainsaw Man 10 (Paperback)"], "Authors": ["Tatsuki Fujimoto"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Broke young man + chainsaw dog demon = Chainsaw Man!\n\nDenji was a small-time devil hunter just trying to survive in a harsh world. After being killed on a job, he is revived by his pet devil Pochita and becomes something new and dangerous-Chainsaw Man!\n\nHaving been forced to kill a friend, Denji finds that his brain has turned to mush from despair. Without the motivation to keep going, he seeks help from Makima. But Makima is not what she appears, and Denji's pain is only just beginning."]}, {"IDS": ["19970e8b-a186-4b44-9513-b432c44dccf0"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974726448"], "Names": ["The Liminal Zone - Junji Ito (Hardback)"], "Authors": ["Junji Ito"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Hardback"], "Descriptions": ["Three-time Eisner Award winner Junji Ito presents brand-new nightmares!\nAfter abruptly departing from a train in a small town, a couple encounters a \"weeping woman\" - a professional mourner - sobbing inconsolably at a funeral. Mako changes afterward - she can't stop crying!\nIn another tale, having decided to die together, a couple enters Aokigahara, the infamous suicide forest. What is the shocking torrent they discover there?\nOne of horror's greatest talents, Junji Ito beckons readers to join him in an experience of ultimate terror with four new stories."]}, {"IDS": ["ef97ad18-256e-4ead-bc51-e8c134620117"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974730735"], "Names": ["Death Note Short Stories (Paperback)"], "Authors": ["Tsugumi Ohba"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Is Kira's story truly over, or does his influence linger?\nIn this complete collection of Death Note short stories penned by the series' creators, discover tales of lives irrevocably changed by the sinister influence of the Death Note, with surprising and thrilling answers to the question of what it truly takes to use the Death Note... or fight it.\nContains stories \"C-Kira,\" \"a-Kira,\" the Death Note pilot chapter, vignettes of L's life, and more."]}, {"IDS": ["0c5c2234-f6f8-41cf-8375-341f5429454a"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974734641"], "Names": ["Look Back (Paperback)"], "Authors": ["Tatsuki Fujimoto"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["A heart-wrenching single-volume story about the struggles of being an artist, from the creator of Chainsaw Man.\nThe overly confident Fujino and the shut-in Kyomoto couldn't be more different, but a love of drawing manga brings these two small-town girls together. A poignant story of growing up and moving forward that only Tatsuki Fujimoto, the creator of Chainsaw Man, could have crafted.\nTwo young artists from a small town inspire each other to improve their art and become manga creators. But as they grow up, a terrible tragedy will change their lives forever."]}, {"IDS": ["deda80ab-17c2-4344-95f7-921e5b75a6b3"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974734276"], "Names": ["Spy x Family, Vol. 8 - Spy x Family 8 (Paperback)"], "Authors": ["Tatsuya Endo"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["An action-packed comedy about a fake family that includes a spy, an assassin and a telepath!\n\nMaster spy Twilight is unparalleled when it comes to going undercover on dangerous missions for the betterment of the world. But when he receives the ultimate assignment-to get married and have a kid-he may finally be in over his head!\n\nYor is assigned to be bodyguard to a mafia family on a cruise ship by the secret organization Garden. But with Lloyd and Anya also on board thanks to a giveaway they won, Yor is starting to have doubts about her secret life as an assassin..."]}, {"IDS": ["bc353474-71da-4c55-b7fa-5218f3af7182"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974735983"], "Names": ["Bleach 20th Anniversary Edition, Vol. 1 (Paperback)"], "Authors": ["Tite Kubo"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Celebrate the 20th anniversary of international smash-hit Bleach with this exclusive edition of volume 1!\nIchigo Kurosaki never asked for the ability to see ghosts-he was born with the gift. When his family is attacked by a Hollow-a malevolent lost soul-Ichigo becomes a Soul Reaper, dedicating his life to protecting the innocent and helping the tortured spirits themselves find peace. Find out why Tite Kubo's Bleach has become an international manga smash-hit!\nCelebrate 20 years of Bleach with this exclusive volume featuring cover art from the series launch on August 20, 2001 in Weekly Shonen Jump magazine!\nIchigo Kurosaki has always been able to see ghosts, but this ability doesn't change his life nearly as much as his close encounter with Rukia Kuchiki, a Soul Reaper and member of the mysterious Soul Society. While fighting a Hollow, an evil spirit that preys on humans who display psychic energy, Rukia attempts to lend Ichigo some of her powers so that he can save his family; but much to her surprise, Ichigo absorbs every last drop of her energy. Now a full-fledged Soul Reaper himself, Ichigo quickly learns that the world he inhabits is one full of dangerous spirits and, along with Rukia - who is slowly regaining her powers - it's Ichigo's job to protect the innocent from Hollows and help the spirits themselves find peace."]}, {"IDS": ["ae08dd6d-c491-4424-91e3-f8f9b32b2e65"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974720712"], "Names": ["Chainsaw Man, Vol. 6 - Chainsaw Man 6 (Paperback)"], "Authors": ["Tatsuki Fujimoto"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Broke young man + chainsaw dog demon = Chainsaw Man!\n\nDenji was a small-time devil hunter just trying to survive in a harsh world. After being killed on a job, he is revived by his pet devil Pochita and becomes something new and dangerous-Chainsaw Man!\n\nA new girl named Reze has shown up and swept innocent Denji right off his feet. But is Reze exactly what she seems? (Spoiler: Nope!) Is Denji about to find happiness once and for all? (Spoiler: Nope!) Prepare for the storm of all storms when Chainsaw Man looks for true love!"]}, {"IDS": ["776cc8f2-9c40-4fc1-8c77-31bd59f3a67a"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974724048"], "Names": ["Chainsaw Man, Vol. 9 - Chainsaw Man 9 (Paperback)"], "Authors": ["Tatsuki Fujimoto"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Broke young man + chainsaw dog demon = Chainsaw Man!\n\nDenji was a small-time devil hunter just trying to survive in a harsh world. After being killed on a job, he is revived by his pet devil Pochita and becomes something new and dangerous-Chainsaw Man!\n\nWith the climactic battle against the Gun Devil close, Aki may be wavering. Has he found something more important to him than revenge? And what is the true meaning behind the vision shown to him by the Future Devil?"]}, {"IDS": ["65718997-8a14-4c68-92f2-5d4b4a3b5a8a"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421597126"], "Names": ["The Promised Neverland, Vol. 1 - The Promised Neverland 1 (Paperback)"], "Authors": ["Kaiu Shirai"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["The children of the Grace Field House orphanage have their happy lives upended when they find out they're being raised to be fed to demons. Can they escape their fate before it's too late?\n\nLife at Grace Field House has been good for Emma and her fellow orphans. While the daily studying and exams they have to take are tough, their loving caretaker provides them with delicious foods and plenty of playtime. But perhaps not everything is as it seems...\n\nEmma, Norman and Ray are the brightest kids at the Grace Field House orphanage. And under the care of the woman they refer to as \"Mom,\" all the kids have enjoyed a comfortable life. Good food, clean clothes and the perfect environment to learn-what more could an orphan ask for? One day, though, Emma and Norman uncover the dark truth of the outside world they are forbidden from seeing.\n\nShonen Jump's big hit of 2017, a masterful suspense story illustrated by up-and-coming artist Posuka Demizu.\n\n* Releases 2 times a year for 2+ volumes. Series is ongoing.\n* Art show in Japan featuring Posuka Demizu's art in December 2016.\n* Weekly simultaneous serialization in VIZ Media's Weekly Shonen Jump digital magazine.\n* Will appeal to fans of mainstream Shonen Jump series like Assassination Classroom and Death Note."]}, {"IDS": ["f3fd3417-ac49-4164-9088-9477abcaad5c"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974722785"], "Names": ["Chainsaw Man, Vol. 8 - Chainsaw Man 8 (Paperback)"], "Authors": ["Tatsuki Fujimoto"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Broke young man + chainsaw dog demon = Chainsaw Man!\n\nDenji was a small-time devil hunter just trying to survive in a harsh world. After being killed on a job, he is revived by his pet devil Pochita and becomes something new and dangerous-Chainsaw Man!\n\nAs Quanxi and the members of the Special Division battle it out over Denji, the mysterious Santa Claus makes his move. But things are not as they appear, and nobody will be prepared for the darkness and despair about to be unleashed!"]}, {"IDS": ["d82e8d7d-aebf-4914-be25-74c38794cff6"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974709953"], "Names": ["Chainsaw Man, Vol. 3 - Chainsaw Man 3 (Paperback)"], "Authors": ["Tatsuki Fujimoto"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Broke young man + chainsaw dog demon = Chainsaw Man!\n\nDenji was a small-time devil hunter just trying to survive in a harsh world. After being killed on a job, he is revived by his pet devil Pochita and becomes something new and dangerous-Chainsaw Man!\n\nA mysterious devil is demanding Denji's heart! But will the devil hunters from Division 4 agree to this deal to save themselves? Or will Denji have to do what Denji does best-turn into a chainsaw and carve up everything that gets in his way?!"]}, {"IDS": ["d4a67e16-c677-4044-b9f6-91b195f20d25"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974732333"], "Names": ["Jujutsu Kaisen, Vol. 17 - Jujutsu Kaisen 17 (Paperback)"], "Authors": ["Gege Akutami"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["To gain the power he needs to save his friend from a cursed spirit, Yuji Itadori swallows a piece of a demon, only to find himself caught in the midst of a horrific war of the supernatural!\n\nIn a world where cursed spirits feed on unsuspecting humans, fragments of the legendary and feared demon Ryomen Sukuna have been lost and scattered about. Should any demon consume Sukuna's body parts, the power they gain could destroy the world as we know it. Fortunately, there exists a mysterious school of jujutsu sorcerers who exist to protect the precarious existence of the living from the supernatural!\n\nHunted down by Okkotsu and on the brink of death, Itadori recalls a troubling family scene from his past. But why is the former form of Noritoshi Kamo there? As the sorcerers begin to take action toward suppressing the lethal culling game, Maki pays the Zen'in clan a visit..."]}, {"IDS": ["6df76f70-b0dd-4fbd-91f0-5569db353ed7"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421539652"], "Names": ["Death Note Black Edition, Vol. 2 - Death Note Black Edition 2 (Paperback)"], "Authors": ["Takeshi Obata"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Light Yagami is an ace student with great prospects--and he's bored out of his mind. But all that changes when he finds the Death Note, a notebook dropped by a rogue Shinigami death god. Any human whose name is written in the notebook dies, and now Light has vowed to use the power of the Death Note to rid the world of evil. But when criminals begin dropping dead, the authorities send the legendary detective L to track down the killer. With L hot on his heels, will Light lose sight of his noble goal...or his life?"]}, {"IDS": ["d20b3716-d2e6-4123-8214-953b11e393aa"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974720965"], "Names": ["Chainsaw Man, Vol. 7 - Chainsaw Man 7 (Paperback)"], "Authors": ["Tatsuki Fujimoto"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Broke young man + chainsaw dog demon = Chainsaw Man!\n\nDenji was a small-time devil hunter just trying to survive in a harsh world. After being killed on a job, he is revived by his pet devil Pochita and becomes something new and dangerous-Chainsaw Man!\n\nDenji's gotten too famous! After a news program broadcasts Chainsaw Man's heroics, the whole world now wants in on the action! Can Denji's new protection detail keep him safe from all the talented assassins that have assembled in Japan to take him down?!"]}, {"IDS": ["8dd07b9b-ec14-4bb6-8012-21a8f6be76b8"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421587660"], "Names": ["Haikyu!!, Vol. 1 - Haikyu!! 1 (Paperback)"], "Authors": ["Haruichi Furudate"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Ever since he saw the legendary player known as the 'Little Giant\" compete at the national volleyball finals, Shoyo Hinata has been aiming to be the best volleyball player ever! He decides to join the team at the high school the Little Giant went to-and then surpass him. Who says you need to be tall to play volleyball when you can jump higher than anyone else?\nAfter losing his first and last volleyball match against Tobio Kageyama, the King of the Court, Shoyo Hinata swears to become his rival after graduating middle school. But what happens when the guy who is supposed to be his rival ends up being his teammate?!"]}, {"IDS": ["b4a34fbb-5d80-46b4-ad0e-3494e4134c62"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974707133"], "Names": ["Komi Can't Communicate, Vol. 2 - Komi Can't Communicate 2 (Paperback)"], "Authors": ["Tomohito Oda"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["The journey to 100 friends begins with a single conversation.\n\nSocially anxious high school student Shoko Komi's greatest dream is to make some friends, but everyone at school mistakes her crippling social anxiety for cool reserve! With the whole student body keeping their distance and Komi unable to utter a single word, friendship might be forever beyond her reach.\n\nIt's time for the national health exam at Itan High, and the excitement of eye exams and height measurements have fanned the flames of competition for plain jane Makeru Yadano. She's determined to beat the class idol Komi in the health test, and Komi's total obliviousness to their impassioned duel just feeds Makeru's determination. As the epic battle heats up, how will Komi handle her first rival when she's barely made her first friends?!"]}, {"IDS": ["afed3b7a-1bef-49dc-9931-e588d36b12cc"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974725311"], "Names": ["Deadpool: Samurai, Vol. 1 (Paperback)"], "Authors": ["Sanshiro Kasama"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Deadpool moves to Tokyo and makes a mess of everything!\nEveryone's favorite Merc with a Mouth has finally come to manga! As soon as Deadpool moves to Tokyo, he runs afoul of some familiar faces. Before he knows it, he's teaming up with new heroes, battling gods, attending concerts, and being repeatedly dismembered. That's good, right?\nAnyway, Deadpool lands in Tokyo with a bang! What could possibly go wrong when Iron Man invites Deadpool join the Avengers' new Samurai Squad? After all, Deadpool is just in it for the money... and the trip to Japan. This is fine, right?"]}, {"IDS": ["5754c2f5-6148-431f-8dd5-0d8053d2ee05"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974700523"], "Names": ["Demon Slayer: Kimetsu no Yaiba, Vol. 1 - Demon Slayer: Kimetsu no Yaiba 1 (Paperback)"], "Authors": ["Koyoharu Gotouge"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Tanjiro sets out on the path of the Demon Slayer to save his sister and avenge his family!\n\nIn Taisho-era Japan, Tanjiro Kamado is a kindhearted boy who makes a living selling charcoal. But his peaceful life is shattered when a demon slaughters his entire family. His little sister Nezuko is the only survivor, but she has been transformed into a demon herself! Tanjiro sets out on a dangerous journey to find a way to return his sister to normal and destroy the demon who ruined his life.\n\nLearning to slay demons won't be easy, and Tanjiro barely knows where to start. The surprise appearance of another boy named Giyu, who seems to know what's going on, might provide some answers...but only if Tanjiro can stop Giyu from killing his sister first!\n\nAction-adventure title similar to InuYasha that pits samurai swords against demons."]}, {"IDS": ["49cb1d38-c08e-4873-8429-118a29f84cb6"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781646512010"], "Names": ["Sailor Moon 1 (Naoko Takeuchi Collection) - Sailor Moon Naoko Takeuchi Collection 1 (Paperback)"], "Authors": ["Naoko Takeuchi"], "Publishers": ["Kodansha America, Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["A new edition of the Sailor Moon manga, for a new generation of fans! Featuring the updated translation and high page count of the Sailor Moon Eternal Edition in a more affordable, portable edition, perfect to go wherever you or the magical guardian in your life want to take it. Teenager Usagi is not the best athlete, she's never gotten good grades, and, well, she's a bit of a crybaby. But when she meets a talking cat, she begins a journey that will teach her she has a well of great strength just beneath the surface and the heart to inspire and stand up for her friends as Sailor Moon! The original Sailor Moon in a new, affordable edition."]}, {"IDS": ["3085be48-195a-4c79-873c-711493d8c23b"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781612620244"], "Names": ["Attack On Titan 1 (Paperback)"], "Authors": ["Hajime Isayama"], "Publishers": ["Kodansha America, Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Several hundred years ago, humans were nearly exterminated by giants. Giants are typically several stories tall, seem to have no intelligence and who devour human beings. A small percentage of humanity survied barricading themselves in a city protected by walls even taller than the biggest of giants.\nFlash forward to the present and the city has not seen a giant in over 100 years - before teenager Elen and his foster sister Mikasa witness something horrific as the city walls are destroyed by a super-giant that appears from nowhere."]}, {"IDS": ["eda37498-d307-4d7c-b2bf-1a5ac21d8cd1"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974710034"], "Names": ["Jujutsu Kaisen, Vol. 2 - Jujutsu Kaisen 2 (Paperback)"], "Authors": ["Gege Akutami"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Yuji Itadori is resolved to save the world from cursed demons, but he soon learns that the best way to do it is to slowly lose his humanity and become one himself!\n\nIn a world where cursed spirits feed on unsuspecting humans, fragments of the legendary and feared demon Ryomen Sukuna were lost and scattered about. Should any demon consume Sukuna's body parts, the power they gain could destroy the world as we know it. Fortunately, there exists a mysterious school of Jujutsu Sorcerers who exist to protect the precarious existence of the living from the supernatural!\n\nA cursed womb mysteriously appears at a detention facility. Itadori and his classmates are dispatched to the scene, but they're in for quite the surprise when they're attacked by a special-grade curse! Itadori allows Sukuna to take over his body in order to survive, but the consequences are more drastic than anyone expected!"]}, {"IDS": ["581bcad5-11d0-4d0f-9955-3988ff3ee6f8"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421578798"], "Names": ["JoJo's Bizarre Adventure: Part 1--Phantom Blood, Vol. 1 - JoJo's Bizarre Adventure: Part 1--Phantom Blood 1 (Hardback)"], "Authors": ["Hirohiko Araki"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Hardback"], "Descriptions": ["The legendary Shonen Jump series, now available in English for the first time, in a deluxe edition featuring color pages and newly drawn cover art! JoJo's Bizarre Adventure is a groundbreaking manga famous for its outlandish characters, wild humor and frenetic battles. A multigenerational tale of the heroic Joestar family and their never-ending battle against evil!\nYoung Jonathan Joestar's life is forever changed when he meets his new adopted brother, Dio. For some reason, Dio has a smoldering grudge against him and derives pleasure from seeing him suffer. But every man has his limits, as Dio finds out. This is the beginning of a long and hateful relationship!"]}, {"IDS": ["f6d5a652-145b-4c08-a9e9-d7997a22c63f"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421536255"], "Names": ["One Piece (Omnibus Edition), Vol. 1: Includes vols. 1, 2 & 3 - One Piece (Omnibus Edition) 1 (Paperback)"], "Authors": ["Eiichiro Oda"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["High jinx on the high seas! As a child, Monkey D. Luffy dreamed of becoming the King of the Pirates. But his life changed when he accidentally gained the power to stretch like rubber...at the cost of never being able to swim again! Now Luffy, with the help of a motley collection of pirate wannabes, is setting off in search of the 'One Piece,' said to be the greatest treasure in the world! With all the Officer Agents defeated, only Crocodile and his final plan to destroy the palace stands in the way of peace. While Luffy battles it out with the evil Croc in the royal tombs, Vivi and the rest of the Straw Hats have to find the bomb before it blows up the capital - with everyone in it!\nAn omnibus edition of One Piece containing the first 3 volumes."]}, {"IDS": ["2a7a971a-b09f-402f-8411-e9a278660f33"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974700547"], "Names": ["Demon Slayer: Kimetsu no Yaiba, Vol. 3 - Demon Slayer: Kimetsu no Yaiba 3 (Paperback)"], "Authors": ["Koyoharu Gotouge"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Tanjiro sets out on the path of the Demon Slayer to save his sister and avenge his family!\n\nIn Taisho-era Japan, Tanjiro Kamado is a kindhearted boy who makes a living selling charcoal. But his peaceful life is shattered when a demon slaughters his entire family. His little sister Nezuko is the only survivor, but she has been transformed into a demon herself! Tanjiro sets out on a dangerous journey to find a way to return his sister to normal and destroy the demon who ruined his life.\n\nTanjiro and Nezuko cross paths with two powerful demons who fight with magical weapons. Even help from Tamayo and Yushiro may not be enough to defeat these demons who claim to belong to the Twelve Kizuki that directly serve Kibutsuji, the demon responsible for all of Tanjiro's woes! But if these demons can be defeated, what secrets can they reveal about Kibutsuji?"]}, {"IDS": ["7df9c599-c201-4231-b06d-b6eb41c47c01"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781975347338"], "Names": ["Toilet-bound Hanako-kun, Vol. 16 (Paperback)"], "Authors": ["AidaIro"], "Publishers": ["Little, Brown & Company"], "Book_Formats": ["Paperback"], "Descriptions": ["In exchange for a life, the link between this world and the next has been severed. Even\nso, Nene and Kou continue looking for a way to reach the boundaries, a search that\nleads them to the cursed \"Red House.\" Inside, they find a boy who looks just like\nHanako-kun and may have the answers they've been looking for-but they soon find the\nRed House is much easier to enter than to leave..."]}, {"IDS": ["fb7f381e-d27c-4bb2-8ddc-a7503d870e06"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781638585657"], "Names": ["Love is an Illusion! Vol. 1 - Love is an Illusion! 1 (Paperback)"], "Authors": ["Fargo"], "Publishers": ["Seven Seas Entertainment, LLC"], "Book_Formats": ["Paperback"], "Descriptions": ["Hye-sung spent his entire life believing he was an Alpha, the jackpot of the genetic lottery. But his world is flipped upside down when he finds out he isn't a dominating Alpha, but a submissive Omega. His frustration is pushed to its limits when he constantly crosses paths with the handsome Dojin, a true Alpha. Dojin supposedly can't stand Omegas, but his head-butting with Hye-sung results in explosive arguments and unexpected sex. Is this sizzling chemistry truly just their bodies reacting?"]}, {"IDS": ["e5bcf037-de82-4010-aa4f-90f9cf240282"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781638585718"], "Names": ["Tokyo Revengers (Omnibus) Vol. 1-2 (Paperback)"], "Authors": ["Ken Wakui"], "Publishers": ["Seven Seas Entertainment, LLC"], "Book_Formats": ["Paperback"], "Descriptions": ["The critically acclaimed manga series about a man time-traveling back to his youth to save his girlfriend from a street gang-which inspired the wildly popular anime and live-action film!\nWatching the news, Hanagaki Takemichi learns his junior-high girlfriend Tachibana Hinata has died. A sudden shove sends him 12 years into the past to face the Tokyo Manji Gang that once made his life hell, which is also responsible for Hinata's death in the present. To save Hinata and change the future, Takemichi must rise to the top of Kanto's most sinister delinquent gang! But things aren't so simple when he befriends the gang's leader, Mikey. What turned Mikey from a petulant child to the leader of the most infamous gang in Tokyo?"]}, {"IDS": ["13fce58e-e531-4855-90d3-ba0ebb6e9694"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781591160571"], "Names": ["One Piece, Vol. 2 - One Piece 2 (Paperback)"], "Authors": ["Eiichiro Oda"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Join Monkey D. Luffy and his swashbuckling crew in their search for the ultimate treasure, One Piece!\n\nAs a child, Monkey D. Luffy dreamed of becoming King of the Pirates. But his life changed when he accidentally gained the power to stretch like rubber...at the cost of never being able to swim again! Years, later, Luffy sets off in search of the \"One Piece,\" said to be the greatest treasure in the world...\n\nAs a kid, Monkey D. Luffy vowed to become King of the Pirates and find the legendary treasure called the \"One Piece.\" The enchanted Gum-Gum Fruit has given Luffy the power to stretch like rubber--and his new crewmate, the infamous pirate hunter Roronoa Zolo, strikes fear into the hearts of other buccaneers! But what chance does one rubber guy stand against Nami, a thief so tough she specializes in robbing pirates...or Captain Buggy, a fiendish pirate lord whose weird, clownish appearance conceals even weirder powers? It's pirate vs. pirate in the second swashbuckling volume of One Piece!"]}, {"IDS": ["df309caa-3d7a-4aca-9079-0ab301fa08d8"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974729074"], "Names": ["Animal Crossing: New Horizons, Vol. 3: Deserted Island Diary - Animal Crossing: New Horizons 3 (Paperback)"], "Authors": ["KOKONASU RUMBA"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Join your favorite characters from Animal Crossing ™: New Horizons for all-new adventures in this official manga!\n\nWhat do the residents of Animal Crossing ™: New Horizons get up to when you're not around? Find out all about their antics in this hilarious manga filled with goofy gags and silly stories!\n\nGet ready for even more charming characters from Animal Crossing: New Horizons to show up for all the fun! K.K. Slider might even drop by the island!"]}, {"IDS": ["0504e0be-687a-4126-b997-617e9c124d5e"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974725922"], "Names": ["Animal Crossing: New Horizons, Vol. 1: Deserted Island Diary - Animal Crossing: New Horizons 1 (Paperback)"], "Authors": ["KOKONASU RUMBA"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Join your favorite characters from Animal Crossing ™: New Horizons for all-new adventures in this official manga!\nRead the gag-filled adventures of four goofy residents living among the Animal Crossing ™: New Horizons characters. Includes a bonus Animal Guide with game tips!"]}, {"IDS": ["4b02e2c8-f802-4101-bbda-d47c77765d56"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421576077"], "Names": ["Assassination Classroom, Vol. 1 - Assassination Classroom 1 (Paperback)"], "Authors": ["Yusei Matsui"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["The students in Class 3-E of Kunugigaoka Junior High have a new teacher: an alien octopus with bizarre powers and unlimited strength, who's just destroyed the moon and is threatening to destroy the earth - unless they can kill him first!"]}, {"IDS": ["5c3992a6-1e80-45fd-8561-a04500e04786"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421555645"], "Names": ["Dragon Ball (3-in-1 Edition), Vol. 1: Includes vols. 1, 2 & 3 - Dragon Ball (3-in-1 Edition) (Paperback)"], "Authors": ["Akira Toriyama"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["A seminal series from a legendary creator. Dragon Ball, a wry update on the Chinese Monkey King myth, introduces us to Son Goku, a young monkey-tailed boy whose quiet life is turned upside-down when he meets Bulma, a girl determined to collect the seven Dragon Balls. If she gathers them all, an incredibly powerful dragon will appear and grant her one wish. But the precious orbs are scattered all over the world, and to get them she needs the help of a certain super-strong boy...\nThe first Dragon Ball 3-in-1 Edition, containing volumes 1, 2 & 3"]}, {"IDS": ["32c0e689-bfbd-408e-b076-c75fd3c193e4"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974707140"], "Names": ["Komi Can't Communicate, Vol. 3 - Komi Can't Communicate 3 (Paperback)"], "Authors": ["Tomohito Oda"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Socially anxious high school student Shoko Komi's greatest dream is to make some friends, but everyone at school mistakes her crippling social anxiety for cool reserve. With the whole student body keeping its distance and Komi unable to utter a single word, friendship might be forever beyond her reach.\n\nSummer is about to begin, and Komi would love to be able to spend the long, hot days of vacation hanging out with her new friends. But even though she's made great strides in her personal quest, her communication issues are still strong enough to ruin her fun. Thankfully just thinking of her dear friend Tadano is enough to help her calm down!\n\nA heartwarming comedy about finding the friends who help you thrive."]}, {"IDS": ["5a856fc4-d9c6-4f5a-9447-be0b89a51427"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974710041"], "Names": ["Jujutsu Kaisen, Vol. 3 - Jujutsu Kaisen 3 (Paperback)"], "Authors": ["Gege Akutami"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Yuji Itadori is resolved to save the world from cursed demons, but he soon learns that the best way to do it is to slowly lose his humanity and become one himself!\n\nIn a world where cursed spirits feed on unsuspecting humans, fragments of the legendary and feared demon Ryomen Sukuna were lost and scattered about. Should any demon consume Sukuna's body parts, the power they gain could destroy the world as we know it. Fortunately, there exists a mysterious school of Jujutsu Sorcerers who exist to protect the precarious existence of the living from the supernatural!"]}, {"IDS": ["ae32c0d4-cb49-4178-8ee2-8d56267f725a"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974727148"], "Names": ["Kaiju No. 8, Vol. 2 - Kaiju No. 8 2 (Paperback)"], "Authors": ["Naoya Matsumoto"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Kafka wants to clean up kaiju, but not literally! Will a sudden metamorphosis stand in the way of his dream?\n\nWith the highest kaiju-emergence rates in the world, Japan is no stranger to attack by deadly monsters. Enter the Japan Defense Force, a military organization tasked with the neutralization of kaiju. Kafka Hibino, a kaiju-corpse cleanup man, has always dreamed of joining the force. But when he gets another shot at achieving his childhood dream, he undergoes an unexpected transformation. How can he fight kaiju now that he's become one himself?!\n\nThe final test of the Defense Force has come to an end, but the examinees' challenges aren't over yet. A mysterious humanoid kaiju revives a neutralized honju and sics it on Kikoru Shinomiya. Just when Kikoru seems to be at the end of her rope, Kafka rushes to her defense! But what is the humanoid kaiju's goal?"]}, {"IDS": ["971586e7-2911-49f9-ba22-4052019d7712"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974728374"], "Names": ["Alice in Borderland, Vol. 1 - Alice in Borderland 1 (Paperback)"], "Authors": ["Haro Aso"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["An action-packed thriller and source of the hit Netflix drama where the only way to survive is to play the game!\nEighteen-year-old Ryohei Arisu is sick of his life. School sucks, his love life is a joke, and his future feels like impending doom. As he struggles to exist in a world that can't be bothered with him, Ryohei feels like everything would be better if he were anywhere else. When a strange fireworks show transports him and his friends to a parallel world, Ryohei thinks all his wishes have come true. But this new world isn't an empty paradise, it's a vicious game. And the only way to survive is to play.\nThe first game starts with a bang, but Ryohei manages to beat the clock and save his friends. It's a short-lived victory, however, as they discover that winning only earns them a few days' grace period. If they want to get home, they're going to have to start playing a lot harder."]}, {"IDS": ["389a7d71-f76c-4f2c-8991-d5427b981d2a"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974717248"], "Names": ["Spy x Family, Vol. 2 - Spy x Family 2 (Paperback)"], "Authors": ["Tatsuya Endo"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["An action-packed comedy about a fake family that includes a spy, an assassin and a telepath!\n\nMaster spy Twilight is unparalleled when it comes to going undercover on dangerous missions for the betterment of the world. But when he receives the ultimate assignment-to get married and have a kid-he may finally be in over his head!\n\nTwilight must infiltrate the prestigious Eden Academy to get close to his target Donovan Desmond, but has he ruined his daughter Anya's chances with his outburst during the admissions interview? Perhaps the truly impossible mission this time is making sure Anya both becomes an exemplary student and befriends Donovan's arrogant son Damian!"]}, {"IDS": ["7c3369f3-40d3-4a3c-b848-7c050f26adb6"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974728947"], "Names": ["Sakamoto Days, Vol. 1 - Sakamoto Days 1 (Paperback)"], "Authors": ["Yuto Suzuki"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Kill some time with former hit man Taro Sakamoto!\n\nTaro Sakamoto was once a legendary hit man considered the greatest of all time. Bad guys feared him! Assassins revered him! But then one day he quit, got married, and had a baby. He's now living the quiet life as the owner of a neighborhood store, but how long can Sakamoto enjoy his days of retirement before his past catches up to him?!\n\nTime has passed peacefully for Sakamoto since he left the underworld. He's running a neighborhood store with his lovely wife and child and has gotten a bit...out of shape. But one day a figure from his past pays him a visit with an offer he can't refuse: return to the assassin world or die!"]}, {"IDS": ["adbfb961-f197-48ef-9da3-ac8c2cfbddfc"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421580371"], "Names": ["Tokyo Ghoul, Vol. 2 - Tokyo Ghoul 2 (Paperback)"], "Authors": ["Sui Ishida"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Ghouls live among us, the same as normal people in every way - except their craving for human flesh. Ken Kaneki is an ordinary college student until a violent encounter turns him into the first half-human half-ghoul hybrid. Trapped between two worlds, he must survive Ghoul turf wars, learn more about Ghoul society and master his new powers.\n\nUnable to discard his humanity but equally unable to suppress his Ghoul hunger, Ken finds salvation in the kindness of friendly Ghouls who teach him how to pass as human and eat flesh humanely. But recent upheavals in Ghoul society attract the police like wolves to prey, and they don't discriminate between conscientious and monstrous Ghouls."]}, {"IDS": ["c338e698-281d-4124-a4fc-4ae7989e29ad"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974732173"], "Names": ["One Piece, Vol. 100 - One Piece 100 (Paperback)"], "Authors": ["Eiichiro Oda"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Join Monkey D. Luffy and his swashbuckling crew in their search for the ultimate treasure, One Piece!\n\nAs a child, Monkey D. Luffy dreamed of becoming King of the Pirates. But his life changed when he accidentally gained the power to stretch like rubber...at the cost of never being able to swim again! Years, later, Luffy sets off in search of the One Piece, said to be the greatest treasure in the world...\n\nThe big powers converge as Luffy, Law, and Kid face off against Kaido and Big Mom. Is there any hope of victory against this ultimate alliance?! Onigashima quakes with power as some of the fiercest pirates in the world go head-to-head!!"]}, {"IDS": ["f7914a1d-d7aa-4028-9303-c59c087a2493"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974728992"], "Names": ["Kaiju No. 8, Vol. 3 - Kaiju No. 8 3 (Paperback)"], "Authors": ["Naoya Matsumoto"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Kafka wants to clean up kaiju, but not literally! Will a sudden metamorphosis stand in the way of his dream?\n\nWith the highest kaiju-emergence rates in the world, Japan is no stranger to attack by deadly monsters. Enter the Japan Defense Force, a military organization tasked with the neutralization of kaiju. Kafka Hibino, a kaiju-corpse cleanup man, has always dreamed of joining the force. But when he gets another shot at achieving his childhood dream, he undergoes an unexpected transformation. How can he fight kaiju now that he's become one himself?!\n\nKafka manages to fight off a humanoid kaiju, rescuing Iharu and Reno. But before he can change back to his human form, Kafka is spotted by Defense Force officers, and the neutralization unit-led by none other than Vice-Captain Hoshina himself-is dispatched to dispose of him. Can Kafka withstand his superior officer's attacks without revealing his true identity?!"]}, {"IDS": ["d53aeadc-5b5f-4883-ab8c-e525bdc6515d"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421520544"], "Names": ["Vagabond (VIZBIG Edition), Vol. 1 - Vagabond VIZBIG Edition 1 (Paperback)"], "Authors": ["Takehiko Inoue"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Striving for enlightenment by way of the sword, Miyamoto Musashi is prepared to cut down anyone who stands in his way. Vagabond is an action-packed portrayal of the life and times of the quintessential warrior-philosopher - the most celebrated samurai of all time!\n\nShinmen Takezo is destined to become the legendary sword-saint, Miyamoto Musashi - perhaps the most renowned samurai of all time. For now, Takezo is a cold-hearted killer, who will take on anyone in mortal combat to make a name for himself. This is the journey of a wild young brute who strives to reach enlightenment by way of the sword - fighting on the edge of death."]}, {"IDS": ["aabcdc8a-4e26-4ba5-b095-f68babb7db26"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974717118"], "Names": ["Jujutsu Kaisen, Vol. 7 - Jujutsu Kaisen 7 (Paperback)"], "Authors": ["Gege Akutami"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["To gain the power he needs to save his friend from a cursed spirit, Yuji Itadori swallows a piece of a demon, only to find himself caught in the midst of a horrific war of the supernatural!\n\nIn a world where cursed spirits feed on unsuspecting humans, fragments of the legendary and feared demon Ryomen Sukuna have been lost and scattered about. Should any demon consume Sukuna's body parts, the power they gain could destroy the world as we know it. Fortunately, there exists a mysterious school of jujutsu sorcerers who exist to protect the precarious existence of the living from the supernatural!\n\nDespite the injuries and losses they suffered in an attack on the Goodwill Event, the students of Jujutsu High have little time rest as people start dying under mysterious circumstances. Could these strange deaths have anything to do with Sukuna's lost fingers?"]}, {"IDS": ["8c4c2f9c-a759-4103-8911-1978d8398596"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781593070205"], "Names": ["Berserk Volume 1 (Paperback)"], "Authors": ["Kentaro Miura"], "Publishers": ["Dark Horse Comics,U.S."], "Book_Formats": ["Paperback"], "Descriptions": [""]}, {"IDS": ["b2f733e8-b254-480b-ad31-ae45c99e28d7"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421561325"], "Names": ["Uzumaki (3-in-1 Deluxe Edition) - Junji Ito (Hardback)"], "Authors": ["Junji Ito"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Hardback"], "Descriptions": ["Kurozu-cho, a small fogbound town on the coast of Japan, is cursed. According to Shuichi Saito, the withdrawn boyfriend of teenager Kirie Goshima, their town is haunted not by a person or being but by a pattern: uzumaki, the spiral, the hypnotic secret shape of the world. It manifests itself in everything from seashells and whirlpools in water to the spiral marks on people's bodies, the insane obsessions of Shuichi's father and the voice from the cochlea in our inner ear. As the madness spreads, the inhabitants of Kurozu-cho are pulled ever deeper into a whirlpool from which there is no return!"]}, {"IDS": ["8072d27d-8599-44de-be26-5f32f9d51347"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9780316554701"], "Names": ["Bungo Stray Dogs, Vol. 1 (Paperback)"], "Authors": ["Kafka Asagiri"], "Publishers": ["Little, Brown & Company"], "Book_Formats": ["Paperback"], "Descriptions": ["Having been kicked out of the orphanage, a despairing young man by the name of Atsushi Nakajima rescues a strange man from a suicide attempt--Osamu Dazai. Turns out that Dazai is part of a detective agency staffed by individuals whose supernatural powers take on a literary bent!"]}, {"IDS": ["9d3a9753-d1fa-4ce0-ad9c-327cee34a6ee"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781626923027"], "Names": ["orange: The Complete Collection 1 - orange 1 (Paperback)"], "Authors": ["Ichigo Takano"], "Publishers": ["Seven Seas Entertainment, LLC"], "Book_Formats": ["Paperback"], "Descriptions": ["Orange: The Complete Collection is a romantic comedy manga series by shoujo author and artist lchigo Takano. This critically-lauded manga series will tug at your heartstrings with its central plot device about time travel and communication with a future self. Seven Seas will release Orange: The Complete Collection in its entirety in two separate 384-page omnibus editions. Each omnibus collection will contain wrap-around covers, colour inserts, and captivating shoujo-style artwork. Everyone has regrets in life. So who wouldn't take the chance to change the past if given the opportunity? When sixteen-year-old Takamiya Naho receives a mysterious letter, claiming to be from her twenty-seven-year-old self, her life is suddenly thrown into flux. The letter informs her that a new transfer student by the name of Naruse Kakeru will be joining her class, and to keep her eye on him. What is Naho to make of the letter's contents and its cryptic warning?"]}, {"IDS": ["210af0bc-2562-46a5-bb28-2870686b1ff7"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974732128"], "Names": ["My Hero Academia, Vol. 31 - My Hero Academia 31 (Paperback)"], "Authors": ["Kohei Horikoshi"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Midoriya inherits the superpower of the world's greatest hero, but greatness won't come easy.\n\nWhat would the world be like if 80 percent of the population manifested superpowers called \"Quirks\"? Heroes and villains would be battling it out everywhere! Being a hero would mean learning to use your power, but where would you go to study? The Hero Academy of course! But what would you do if you were one of the 20 percent who were born Quirkless?\n\nIn the aftermath of the battle in Jaku City, the forces of good are reeling. With so many heroes dead, it seems like society itself is on the verge of collapse. Although Midoriya and the others have managed to drive off Tomura, All For One is only just getting started. As the dust settles, the Todoroki family must finally face their troubled past, and Midoriya begins to understand what One For All really is and that reaching his full potential might test his convictions..."]}, {"IDS": ["51ead73a-5fbf-49dc-ae9d-8bb115cb155f"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974732203"], "Names": ["Deadpool: Samurai, Vol. 2 - Deadpool: Samurai 2 (Paperback)"], "Authors": ["Sanshiro Kasama"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Deadpool moves to Tokyo and makes a mess of everything!\n\nEveryone's favorite Merc with a Mouth is back! As a member of the newly formed Samurai Squad, Deadpool moves to Tokyo, where he soon runs afoul of some familiar faces. Whether he's teaming up with new heroes, battling gods, attending concerts, or being repeatedly dismembered, Deadpool always brings chaos and his characteristic sense of humor along with him!\n\nDeadpool has proven to be a core member of the Avengers Samurai Squad, as befits such a well-loved, respected, efficient, and handsome hero. (Sakura Spider, Neiro, and Kage are present as well.) But Loki is still lurking in the shadows, determined to lure Deadpool to the side of darkness through his wicked schemes.\n\nLook, we'll just say it: this time it's Deadpool versus Thanos, and it only gets weirder from there!"]}, {"IDS": ["563815bc-bb6e-44a9-bd74-83289b0e50c1"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781975311353"], "Names": ["Toilet-bound Hanako-kun, Vol. 3 (Paperback)"], "Authors": ["AidaIro"], "Publishers": ["Little, Brown & Company"], "Book_Formats": ["Paperback"], "Descriptions": ["Nene and Kou want to learn more about their mysterious friend, Hanako-kun-and what better way to do that than school mystery number five, The 4:00 P.M. Bookstacks! The rumors say that a secret door in the library leads the way to a supernaturally special collection. The Bookstacks know everything about everyone who's ever attended Kamome Academy-past, present, AND future! But whatever you do, don't read the red books...or your future will be drenched in blood!"]}, {"IDS": ["dae1205d-2c83-496e-bd42-0835bc69a12b"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421576084"], "Names": ["Assassination Classroom, Vol. 2 - Assassination Classroom 2 (Paperback)"], "Authors": ["Yusei Matsui"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Ever caught yourself screaming, 'I could just kill that teacher'? What would it take to justify such antisocial behavior and weeks of detention? Especially if he's the best teacher you've ever had? Giving you an F on a quiz? Mispronouncing your name during roll call...again? How about blowing up the moon and threatening to do the same to Mother Earth - unless you take him out first? Plus a reward of a cool 100 million from the Ministry of Defense? Okay, now that you're committed... How are you going to pull this off? What does your pathetic class of misfits have at their disposal to combat Teach's alien technology, bizarre powers and...tentacles?!"]}, {"IDS": ["74beb22b-2bac-4f3d-8c16-825ba0697a27"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781506711980"], "Names": ["Berserk Deluxe Volume 1 (Hardback)"], "Authors": ["Kentaro Miura"], "Publishers": ["Dark Horse Comics,U.S."], "Book_Formats": ["Hardback"], "Descriptions": ["Have you got the Guts?\nKentaro Miura’s Berserk has outraged, horrified, and delighted manga and anime fanatics since 1989, creating an international legion of hardcore devotees and inspiring a plethora of TV series, feature films, and video games.\nAnd now the badass champion of adult fantasy manga is presented in an oversized 7″ x 10″ deluxe hardcover edition, nearly 700 pages amassing the first three Berserk volumes, with following volumes to come to serve up the entire series in handsome bookshelf collections.\nNo Guts, no glory!"]}, {"IDS": ["5c14225a-9324-4e39-8dd3-56ca76cf7941"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781648271168"], "Names": ["Dai Dark Vol. 1 (Paperback)"], "Authors": ["Q Hayashida"], "Publishers": ["Seven Seas Entertainment, LLC"], "Book_Formats": ["Paperback"], "Descriptions": ["Zaha Sanko's body has great and terrible powers - they say that possessing his bones will grant you any wish, even the desire to become ruler of the universe. But Sanko is still a teenage dude with his own life, and he isn't about to let every monstrous lowlife in the galaxy rip him limb from limb.\nHe and his skeletal buddy Avakian will use their dark powers to fend off any murder attempts while they search space for whomever put this curse on Sanko's bones...because killing them might end the madness. (And then Sanko can celebrate with his favorite spaghetti.)\nDon't miss this hilariously twisted and gruesome new series from the unique mind of Q Hayashida, creator of the manga and Netflix anime Dorohedoro!"]}, {"IDS": ["35a67b4b-f13d-434d-b435-52cc49fe2e12"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974719860"], "Names": ["Deserter: Junji Ito Story Collection - Junji Ito (Hardback)"], "Authors": ["Junji Ito"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Hardback"], "Descriptions": ["An ever-increasing malice. A mind-numbing terror. The seeds of horror are sown in this collection of Junji Ito's earliest works.\nA vengeful family hides an army deserter for eight years after the end of World War II, cocooning him in a false reality where the war never ended. A pair of girls look alike, but they're not twins. And a boy's nightmare threatens to spill out into the real world...\nThis hauntingly strange story collection showcases a dozen of Junji Ito's earliest works from when he burst onto the horror scene, sowing fresh seeds of terror."]}, {"IDS": ["cb3b728c-f997-4538-8256-52f921aa91a0"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781506709871"], "Names": ["Mob Psycho 100 Volume 1 (Paperback)"], "Authors": ["ONE"], "Publishers": ["Dark Horse Comics,U.S."], "Book_Formats": ["Paperback"], "Descriptions": [""]}, {"IDS": ["ff2f1f2c-fa8d-40ec-a8db-7bb9cd6927e4"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974700578"], "Names": ["Demon Slayer: Kimetsu no Yaiba, Vol. 6 - Demon Slayer: Kimetsu no Yaiba 6 (Paperback)"], "Authors": ["Koyoharu Gotouge"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["In Taisho-era Japan, Tanjiro Kamado is a kindhearted boy who makes a living selling charcoal. But his peaceful life is shattered when a demon slaughters his entire family. His little sister Nezuko is the only survivor, but she has been transformed into a demon herself! Tanjiro sets out on a dangerous journey to find a way to return his sister to normal and destroy the demon who ruined his life.\n\nThe members of the Demon Slayer Corps are sworn to destroy demons wherever they find them-but the condition of Tanjiro's sister, Nezuko, is a problem. What will the Hashira-the leaders of the Demon Slayer Corps-do about Tanjiro protecting his own demonic sister? Meanwhile, Kibutsuji assembles his own minions and intensifies his search for Tanjiro..."]}, {"IDS": ["372a8dd9-5cdb-4853-b470-5296fbdf6f18"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781648279171"], "Names": ["Heaven Official's Blessing: Tian Guan Ci Fu (Novel) Vol. 1 - Heaven Official's Blessing: Tian Guan Ci Fu 1 (Paperback)"], "Authors": ["Mo Xiang Tong Xiu"], "Publishers": ["Seven Seas Entertainment, LLC"], "Book_Formats": ["Paperback"], "Descriptions": ["The blockbuster danmei/Boys' Love novels from China that inspired the animated series! This epic historical fantasy about a prince and the mysterious man by his side is now in English, for the very first time! Born the crown prince of a prosperous kingdom, Xie Lian was renowned for his beauty, strength, and purity. His years of dedication and noble deeds allowed him to ascend to godhood. But those who rise, can also fall...and fall he does, cast from the Heavens again and again and banished to the mortal realm. Eight hundred years after his mortal life, Xie Lian has ascended to godhood for the third time. Now only a lowly scrap collector, he is dispatched to wander the earthly realm to take on tasks appointed by the heavens to pay back debts and maintain his divinity. Aided by old friends and foes alike, and graced with the company of a mysterious young man with whom he feels an instant connection, Xie Lian must confront the horrors of his past in order to dispel the curse of his present. This xianxia fantasy tale built around the romanticized love between two men (danmei) has spawned an ongoing multimedia franchise that's beloved across the world. The Seven Seas English-language edition will include covers from (tai3_3), and exclusive, all-new interior illustrations from ZeldaCW."]}, {"IDS": ["d48755fe-8442-4de2-9c13-e65a947e17eb"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781638582106"], "Names": ["Heaven Official's Blessing: Tian Guan Ci Fu (Novel) Vol. 3 - Heaven Official's Blessing: Tian Guan Ci Fu (Novel) 3 (Paperback)"], "Authors": ["Mo Xiang Tong Xiu"], "Publishers": ["Seven Seas Entertainment, LLC"], "Book_Formats": ["Paperback"], "Descriptions": ["SOMETHING TO FIGHT FOR, SOMEONE TO LIVE FOR Gods should never meddle in the affairs of mortals, but Xie Lian is not one to follow the rules when lives are at risk. He spits in the face of heaven and its laws and descends in a fury to save his country from drought and civil war. Yet this golden child gets a harsh dose of reality when he discovers just how little one individual-even a god-can do to save a crumbling nation. As the people reject and betray him, one young soldier stands by Xie Lian-a boy with a face wrapped in bandages and a fierce loyalty in his heart. In this chaotic past, can an unshakable bond grow from the ashes of unimaginable destruction?"]}, {"IDS": ["9e7e664d-1010-4045-9705-38aa6d0a02a1"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781648279188"], "Names": ["Heaven Official's Blessing: Tian Guan Ci Fu (Novel) Vol. 2 - Heaven Official's Blessing: Tian Guan Ci Fu 2 (Paperback)"], "Authors": ["Mo Xiang Tong Xiu"], "Publishers": ["Seven Seas Entertainment, LLC"], "Book_Formats": ["Paperback"], "Descriptions": ["The blockbuster danmei/Boys' Love novels from China that inspired the animated series! This epic historical fantasy about a prince and the mysterious man by his side is now in English, for the very first time. Born the crown prince of a prosperous kingdom, Xie Lian was renowned for his beauty, strength, and purity. His years of dedication and noble deeds allowed him to ascend to godhood. But those who rise, can also fall...and fall he does, cast from the Heavens again and again and banished to the mortal realm. Eight hundred years after his mortal life, Xie Lian has ascended to godhood for the third time. Now only a lowly scrap collector, he is dispatched to wander the earthly realm to take on tasks appointed by the heavens to pay back debts and maintain his divinity. Aided by old friends and foes alike, and graced with the company of a mysterious young man with whom he feels an instant connection, Xie Lian must confront the horrors of his past in order to dispel the curse of his present. This Chinese xianxia fantasy novel series built around the romanticized love between two men (danmei) is the newest work from author Mo Xiang Tong Xiu, and has spawned an ongoing multimedia franchise that's beloved across the world--including the animated series (donghua) that amassed 100+ million views in just its first month. The Seven Seas English-language edition will include covers from (tai3_3), and exclusive, all-new interior illustrations from ZeldaCW."]}, {"IDS": ["c1017332-b942-49fd-9401-f598eaa8c040"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974732142"], "Names": ["Sakamoto Days, Vol. 2 - Sakamoto Days 2 (Paperback)"], "Authors": ["Yuto Suzuki"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Kill some time with former hit man Taro Sakamoto!\n\nTaro Sakamoto was once a legendary hit man considered the greatest of all time. Bad guys feared him! Assassins revered him! But then one day he quit, got married, and had a baby. He's now living the quiet life as the owner of a neighborhood store, but how long can Sakamoto enjoy his days of retirement before his past catches up to him?!\n\nShin faces off with a strange assassin who's targeting Mr. Sakamoto, but how will he manage against a foe whose thoughts are unreadable? Then, the Sakamoto gang does their best to enjoy a peaceful family outing at the amusement park, only to be rudely interrupted by a pair of menacing assassins. Can Mr. Sakamoto and his buddies take care of them without his family noticing?"]}, {"IDS": ["a75df5ba-a374-4ae9-b9c3-3e36c80f6a77"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421540320"], "Names": ["Blue Exorcist, Vol. 1 - Blue Exorcist 1 (Paperback)"], "Authors": ["Kazue Kato"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Raised by Father Fujimoto, a famous exorcist, Rin Okumura never knew his real father. One day a fateful argument with Father Fujimoto forces Rin to face a terrible truth - the blood of the demon lord Satan runs in Rin's veins! Rin swears to defeat Satan, but doing that means entering the mysterious True Cross Academy and becoming an exorcist himself. Can Rin fight demons and keep his infernal bloodline a secret? It won't be easy, especially when drawing his father's sword releases the demonic power within him!"]}, {"IDS": ["7b4a1e68-da87-44bb-bd54-e02dcbe421b6"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421539645"], "Names": ["Death Note Black Edition, Vol. 1 - Death Note Black Edition 1 (Paperback)"], "Authors": ["Takeshi Obata"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Light Yagami is an ace student with great prospects - and he's bored out of his mind. But all that changes when he finds the Death Note, a notebook dropped by a rogue Shinigami death god. Any human whose name is written in the notebook dies, and now Light has vowed to use the power of the Death Noteto rid the world of evil. But when criminals begin dropping dead, the authorities send the legendary detective L to track down the killer. With L hot on his heels, will Light lose sight of his noble goal...or his life?\nThis contains the first two volumes of Death Note."]}, {"IDS": ["335cf763-1c13-4986-84b4-c91bf10c414c"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781638581567"], "Names": ["Grandmaster of Demonic Cultivation: Mo Dao Zu Shi (Novel) Vol. 3 - Grandmaster of Demonic Cultivation: Mo Dao Zu Shi (Novel) 3 (Paperback)"], "Authors": ["Mo Xiang Tong Xiu"], "Publishers": ["Seven Seas Entertainment, LLC"], "Book_Formats": ["Paperback"], "Descriptions": ["Wei Wuxian was once one of the most powerful men of his generation, a talented and clever young cultivator who harnessed martial arts and spirituality into powerful abilities. But when the horrors of war led him to seek more power through demonic cultivation, the world's respect for his abilities turned to fear, and his death was celebrated throughout the land. Years later, he awakens in the body of an aggrieved young man who sacrifices his soul so that Wei Wuxian can exact revenge on his behalf. Though granted a second life, Wei Wuxian is not free from his first, nor the mysteries that appear before him now. Yet this time, he'll face it all with the righteous and esteemed Lan Wangji at his side, another powerful cultivator whose unwavering dedication and shared memories of their past will help shine a light on the dark truths that surround them. This Chinese xianxia fantasy novel series built around the romanticized love between two men (danmei) has been translated into numerous languages and spawned a multimedia franchise that has taken the globe by storm, including the massively popular live-action series The Untamed available now on Netflix, YouTube, and more. The Seven Seas English-language edition will include exclusive, all-new covers from Jin Fang (jinzillaa), interior illustrations from Marina Privalova (BaoshanKaro), and a translation by Suika (yummysuika) with editor Pengie (pengiesama)."]}, {"IDS": ["73387683-743e-4788-9fa3-8e959613c6b0"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421587028"], "Names": ["My Hero Academia, Vol. 5 - My Hero Academia 5 (Paperback)"], "Authors": ["Kohei Horikoshi"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["What would the world be like if 80 percent of the population manifested superpowers called \"Quirks\"? Heroes and villains would be battling it out everywhere! Being a hero would mean learning to use your power, but where would you go to study? The Hero Academy of course! But what would you do if you were one of the 20 percent who were born Quirkless?\nThe final stages of the U.A. High sports festival promise to be explosive as Uraraka takes on Bakugo in a head to head match! Bakugo never gives anyone a break, and the crowd holds its breath as the battle begins. The finals will push the students of Class 1-A to their limits and beyond!"]}, {"IDS": ["c04aacd4-4c98-4553-8313-db1f0e74c6cb"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421580388"], "Names": ["Tokyo Ghoul, Vol. 3 - Tokyo Ghoul 3 (Paperback)"], "Authors": ["Sui Ishida"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Ghouls live among us, the same as normal people in every way - except their craving for human flesh. Ken Kaneki is an ordinary college student until a violent encounter turns him into the first half-human half-ghoul hybrid. Trapped between two worlds, he must survive Ghoul turf wars, learn more about Ghoul society and master his new powers.\n\nKaneki is still trying to get used to his new life when Commission of Counter Ghoul agents Mado and Amon start sniffing around for Hinami. Kaneki and Touka are going to have to get them off her tail and fast. No easy task now that Kaneki's got to bring humans and Ghouls to a rapid truce at the same time."]}, {"IDS": ["daf823fd-33ba-405a-8b0b-100a240ccdee"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421501680"], "Names": ["Death Note, Vol. 1 - Death Note 1 (Paperback)"], "Authors": ["Tsugumi Ohba"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Light Yagami is an ace student with great prospects - and he's bored out of his mind. But all that changes when he finds the Death Note, a notebook dropped by a rogue Shinigami death god. Any human whose name is written in the notebook dies, and now Light has vowed to use the power of the Death Noteto rid the world of evil. But when criminals begin dropping dead, the authorities send the legendary detective L to track down the killer. With L hot on his heels, will Light lose sight of his noble goal...or his life?\n\nLight tests the boundaries of the Death Note's powers as L and the police begin to close in. Luckily Light's father is the head of the Japanese National Police Agency and leaves vital information about the case lying around the house. With access to his father's files, Light can keep one step ahead of the authorities. But who is the strange man following him, and how can Light guard against enemies whose names he doesn't know?"]}, {"IDS": ["7208a7fd-deee-4187-a7ea-c253e8a884a6"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974728381"], "Names": ["Demon Slayer: Kimetsu no Yaiba - Stories of Water and Flame (Paperback)"], "Authors": ["Ryoji Hirano"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["One volume featuring two action-packed tales from the universe of Demon Slayer: Kimetsu no Yaiba!\nSavage demons devour unsuspecting humans in Taisho-era Japan. Armed with special swords, the Demon Slayer Corps fights to stop the devastation demons spread. Giyu Tomioka, the sole Water Hashira, and Kyojuro Rengoku, a high-ranking Kinoe, embark on missions to eliminate demons and prove their mettle as two of the fiercest Demon Slayers.\nGiyu heads north to an area where a band of hunters was killed. He and the Insect Hashira meet Yae, the daughter of a slain hunter, who believes a bear killed her father, but the truth is harder to face. Kyojuro also receives his newest assignment and hopes completing it will prove he's worthy of the title Flame Hashira, which his father abandoned. An explosive battle unfolds as Kyojuro takes on a demon of the Twelve Kizuki who holds a grudge against Kyojuro's father."]}, {"IDS": ["fb4e9ca7-6a96-479c-a08d-f5d2aedada63"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974702619"], "Names": ["Dr. STONE, Vol. 1 - Dr. STONE 1 (Paperback)"], "Authors": ["Riichiro Inagaki"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Imagine waking to a world where every last human has been mysteriously turned to stone...\n\nOne fateful day, all of humanity turned to stone. Many millennia later, Taiju frees himself from the petrification and finds himself surrounded by statues. The situation looks grim-until he runs into his science-loving friend Senku! Together they plan to restart civilization with the power of science!\n\nWhen every human on Earth is turned to stone by a mysterious phenomenon, high-schooler Taiju is also petrified the moment he's about to confess to his high-school crush. Flash forward several thousands of years later, Taiju awakens and joins up with his friend Senku, who has ambitious dreams. His plan: to restart civilization from square one with the power of science!"]}, {"IDS": ["0a35b063-a59b-4e29-9e8c-8f0eb8903937"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421576091"], "Names": ["Assassination Classroom, Vol. 3 - Assassination Classroom 3 (Paperback)"], "Authors": ["Yusei Matsui"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Ever caught yourself screaming, I could just kill that teacher? What would it take to justify such antisocial behavior and weeks of detention? Especially if he's the best teacher you've ever had? Giving you an F on a quiz? Mispronouncing your name during roll call...again? How about blowing up the moon and threatening to do the same to Mother Earth - unless you take him out first?! Plus a reward of a cool 100 million from the Ministry of Defense! Okay, now that you're committed... How are you going to pull this off? What does your pathetic class of misfits have at their disposal to combat Teach's alien technology, bizarre powers and...tentacles?!"]}, {"IDS": ["3ded3b43-1729-44fb-b149-af83715c6391"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974728480"], "Names": ["Spy x Family, Vol. 7 - Spy x Family 7 (Paperback)"], "Authors": ["Tatsuya Endo"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["An action-packed comedy about a fake family that includes a spy, an assassin and a telepath!\n\nMaster spy Twilight is unparalleled when it comes to going undercover on dangerous missions for the betterment of the world. But when he receives the ultimate assignment-to get married and have a kid-he may finally be in over his head!\n\nAs Donovan Desmond is about to share a rare family moment with his son Damian, Twilight cuts in to meet his target face-to-face for the first time. Can Twilight find some way to endear himself to the inscrutable Donovan?"]}, {"IDS": ["5651c82e-1cda-4ba7-b0c4-2fd0a31b0a23"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974703760"], "Names": ["Frankenstein: Junji Ito Story Collection - Junji Ito (Hardback)"], "Authors": ["Junji Ito"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Hardback"], "Descriptions": ["The master of horror manga brings the world's greatest horror novel-Frankenstein-back to life.\n\nJunji Ito meets Mary Shelley! The master of horror manga bends all his skill into bringing the anguished and solitary monster and the fouler beast who created him with the brilliantly detailed chiaroscuro he is known for.\n\nAlso included are is the Oshikiri story cycle-a high school student who lives in a decaying mansion connected to a haunted parallel world. Uncanny doppelgangers, unfortunately murdered friends, and a whole lot more are in store for him.\n\nBonus: Ito's dog! Thrill to the adventures of Non-non Ito, an adorable Maltese!"]}, {"IDS": ["92a44091-d7ff-4687-b0e2-4756c8bbf818"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974728985"], "Names": ["Jujutsu Kaisen, Vol. 16 - Jujutsu Kaisen 16 (Paperback)"], "Authors": ["Gege Akutami"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["To gain the power he needs to save his friend from a cursed spirit, Yuji Itadori swallows a piece of a demon, only to find himself caught in the midst of a horrific war of the supernatural!\n\nIn a world where cursed spirits feed on unsuspecting humans, fragments of the legendary and feared demon Ryomen Sukuna have been lost and scattered about. Should any demon consume Sukuna's body parts, the power they gain could destroy the world as we know it. Fortunately, there exists a mysterious school of jujutsu sorcerers who exist to protect the precarious existence of the living from the supernatural!\n\nAfter he consumes Mahito's soul, Geto reveals part of his nefarious plan to Itadori and the others. In that moment, Choso recognizes the evil sorcerer possessing Geto's body and is filled with rage! Who is this evil sorcerer, and what relation do they have to Choso? Now that Gojo is imprisoned and the foundations of jujutsu society are crumbling, what will happen to the world as it devolves into destruction and chaos?!"]}, {"IDS": ["50180ef9-53c2-4977-acb3-884143c4de77"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421597133"], "Names": ["The Promised Neverland, Vol. 2 - The Promised Neverland 2 (Paperback)"], "Authors": ["Kaiu Shirai"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["The children of the Grace Field House orphanage have their happy lives upended when they find out they're being raised to be fed to demons. Can they escape their fate before it's too late?\n\nLife at Grace Field House has been good for Emma and her fellow orphans. While the daily studying and exams they have to take are tough, their loving caretaker provides them with delicious foods and plenty of playtime. But perhaps not everything is as it seems...\n\nThe children of Grace Field House find themselves in even more trouble as Sister Krone continues to snoop around. Can they keep their escape plans from being uncovered? And which child is the traitor working for Mom?\n\nShonen Jump's big hit of 2017, a masterful suspense story illustrated by up-and-coming artist Posuka Demizu."]}, {"IDS": ["439f05e5-37a9-46f5-9dea-2884dab03bb7"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421599779"], "Names": ["Fullmetal Alchemist: Fullmetal Edition, Vol. 1 - Fullmetal Alchemist: Fullmetal Edition 1 (Hardback)"], "Authors": ["Hiromu Arakawa"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Hardback"], "Descriptions": ["Alchemy tore the Elric brothers' bodies apart. Can their bond make them whole again?\n\nA hardcover, deluxe collector's edition of one of the most beloved manga and anime of all time! Fully remastered with an updated translation and completely fresh lettering, and presented with color pages on large-trim archival-quality paper, this gorgeous hardcover edition presents the timeless dark adventures of the Elric brothers as they were truly meant to be seen. Includes brand-new cover art, color inserts and behind-the-scenes character sketches from author Hiromu Arakawa!\n\nIn an alchemical ritual gone wrong, Edward Elric lost his arm and his leg, and his brother Alphonse became nothing but a soul in a suit of armor. Equipped with mechanical \"auto-mail\" limbs, Edward becomes a state alchemist, seeking the one thing that can restore his and his brother's bodies...the legendary Philosopher's Stone.\n\nThe best-selling manga Fullmetal Alchemist finally available in a high-quality hardcover collectors' edition."]}, {"IDS": ["a10be61d-7d4a-42d0-a986-f5d837f64374"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974718719"], "Names": ["Jujutsu Kaisen, Vol. 8 - Jujutsu Kaisen 8 (Paperback)"], "Authors": ["Gege Akutami"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Yuji Itadori is resolved to save the world from cursed demons, but he soon learns that the best way to do it is to slowly lose his humanity and become one himself!\nIn a world where cursed spirits feed on unsuspecting humans, fragments of the legendary and feared demon Ryomen Sukuna were lost and scattered about. Should any demon consume Sukuna's body parts, the power they gain could destroy the world as we know it. Fortunately, there exists a mysterious school of Jujutsu Sorcerers who exist to protect the precarious existence of the living from the supernatural!\nYuji Itadori and his classmates are fighting two of the three reincarnated Cursed Womb: Death Paintings brothers. Meanwhile, Megumi Fushiguro loses consciousness after finally defeating a special grade curse that possessed a Sukuna finger! Whoever wins the fight between Itadori and the brothers will be the one to secure the prized finger!"]}, {"IDS": ["7e32f5b7-6733-44f7-9729-8a12957feb02"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974704415"], "Names": ["Demon Slayer: Kimetsu no Yaiba, Vol. 7 - Demon Slayer: Kimetsu no Yaiba 7 (Paperback)"], "Authors": ["Koyoharu Gotouge"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["In Taisho-era Japan, Tanjiro Kamado is a kindhearted boy who makes a living selling charcoal. But his peaceful life is shattered when a demon slaughters his entire family. His little sister Nezuko is the only survivor, but she has been transformed into a demon herself! Tanjiro sets out on a dangerous journey to find a way to return his sister to normal and destroy the demon who ruined his life.\n\nShinobu, Tanjiro, Zenitsu, Inosuke and Nezuko have recovered while under the care of the Demon Slayer Corps. They have even learned a new and powerful technique-Total Concentration! They'll need this new power and all their skill on their next demon-hunting mission aboard the mysterious Infinity Train as it takes them into the dreams of demons!"]}, {"IDS": ["30dba6f2-51f7-4047-9071-1da4f773efde"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974725274"], "Names": ["My Love Mix-Up Vol. 1 - My Love Mix-Up! 1 (Paperback)"], "Authors": ["Wataru Hinekure"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["In this warmhearted romantic comedy, mistaken identity leads to a blossoming romance between two boys.\nAoki has a crush on Hashimoto, the girl in the seat next to him in class. But he despairs when he borrows her eraser and sees she's written the name of another boy-Ida-on it. To make matters more confusing, Ida sees Aoki holding that very eraser and thinks Aoki has a crush on him!"]}, {"IDS": ["38a13de5-c811-4c50-89a6-1534583ed8d9"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421596938"], "Names": ["Shiver: Junji Ito Selected Stories - Junji Ito (Hardback)"], "Authors": ["Junji Ito"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Hardback"], "Descriptions": ["A best-of story selection by the master of horror manga.\n\nThis volume includes nine of Junji Ito's best short stories, as selected by the author himself and presented with accompanying notes and commentary. An arm peppered with tiny holes dangles from a sick girl's window... After an idol hangs herself, balloons bearing faces appear in the sky, some even featuring your own face... An amateur film crew hires an extremely individualistic fashion model and faces a real bloody ending... An offering of nine fresh nightmares for the delectation of horror fans.\n\nAn exciting addition to VIZ's Junji Ito library, containing Ito's best short stories as selected by the author himself."]}, {"IDS": ["c64b6c08-4446-4e62-bf21-9e3154906d22"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421592541"], "Names": ["Dragon Ball Super, Vol. 1 - Dragon Ball Super 1 (Paperback)"], "Authors": ["Akira Toriyama"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Ever since Goku became Earth's greatest hero and gathered the seven Dragon Balls to defeat the evil Boo, his life on Earth has grown a little dull. But new threats loom overhead, and Goku and his friends will have to defend the planet once again in this continuation of Akira Toriyama's best-selling series, Dragon Ball! Having defeated Boo, Goku is starting to get bored with his life on Earth. His wife, Chi-chi, wants him to get a job, but all he wants to do is train and fight stronger enemies. Elsewhere in the universe, the God of Destruction, Beerus, and his attendant Whis are traveling from planet to planet in search of food and entertainment. After blowing up some hapless victims, Beerus is reminded of a man from his dreams with the moniker \"Super Saiyan God,\" or something like that... The God of Destruction sets his sights on Earth to track down this mysterious man! Maybe this will give Goku something to do?"]}, {"IDS": ["bd948d89-36c9-4b4d-8657-dba2b6b3f828"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781975319458"], "Names": ["Solo Leveling, Vol. 2 (Paperback)"], "Authors": ["Chugong"], "Publishers": ["Little, Brown & Company"], "Book_Formats": ["Paperback"], "Descriptions": ["E-rank hunter Jinwoo Sung thought he would die in the double dungeon...but instead,\nhe heard a mysterious voice telling him that he's now a Player...? This new leveling\nsystem is something he's has never seen or heard of and comes with its own set of\nrules, monsters, and even dungeons! Jinwoo's not sure how or why this is happening\nto him, but if it can make him stronger, he's ready to give it everything he's got!"]}, {"IDS": ["6351de12-17ee-4f6b-828a-960e337be263"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974717477"], "Names": ["Remina - Junji Ito (Hardback)"], "Authors": ["Junji Ito"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Hardback"], "Descriptions": ["Another of Junji Ito's classics, the sci-fi masterwork Remina tells the chilling tale of a hell star.\n\nAn unknown planet emerges from inside a wormhole, and its discoverer, Dr. Oguro, christens the body \"Remina\" after his own daughter. His finding is met with great fanfare, and Remina herself rises to fame. However, the object picks up speed as it moves along in its curious course, eliminating planets and stars one after another, until finally Earth itself faces extinction... Is the girl Remina the true cause of the catastrophe? A masterwork of horror from Junji Ito, unfolding on a universal scale."]}, {"IDS": ["f333ebe0-3af9-4a43-afed-3bc8ccc78192"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974732197"], "Names": ["Sakamoto Days, Vol. 3 - Sakamoto Days 3 (Paperback)"], "Authors": ["Yuto Suzuki"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Kill some time with former hit man Taro Sakamoto!\n\nTaro Sakamoto was once a legendary hit man considered the greatest of all time. Bad guys feared him! Assassins revered him! But then one day he quit, got married, and had a baby. He's now living the quiet life as the owner of a neighborhood store, but how long can Sakamoto enjoy his days of retirement before his past catches up to him?!\n\nTeam Sakamoto enters an airsoft tournament organized by the shopping arcade in the hopes of winning the million-yen prize. However, things don't go as planned and they find themselves teaming up with a not-so-sharp sniper called Heisuke. Meanwhile, some shady characters connected to the secret organization that raised Shin are on their way to Sakamoto's..."]}, {"IDS": ["299a6b72-c8f5-4de6-ae27-c46033c02934"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421593470"], "Names": ["The Legend of Zelda: Twilight Princess, Vol. 1 - The Legend of Zelda: Twilight Princess 1 (Paperback)"], "Authors": ["Akira Himekawa"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Once upon a time, wizards tried to conquer the Sacred Realm of Hyrule. The Spirits of Light sealed the wizards' power within the Shadow Crystal and banished them to the Twilight Realm beyond the Mirror of Twilight. Now, an evil menace is trying to find Midna, princess of the Twilight Realm, and the fragments of the Shadow Crystal to gain the power to rule over both the Twilight Realm and the World of Light."]}, {"IDS": ["5fcf30e0-96e5-4e3f-be91-052ffabb5794"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421585109"], "Names": ["My Hero Academia, Vol. 3 - My Hero Academia 3 (Paperback)"], "Authors": ["Kohei Horikoshi"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["What would the world be like if 80 percent of the population manifested superpowers called \"Quirks\"? Heroes and villains would be battling it out everywhere! Being a hero would mean learning to use your power, but where would you go to study? The Hero Academy of course! But what would you do if you were one of the 20 percent who were born Quirkless?\n\nA sinister group of villains has attacked the first-year U.A. students, but their real target is All Might. It's all that Midoriya and his classmates can do to hold them off until reinforcements arrive. All Might joins the battle to protect the kids, but as his power runs out he may be forced into an extremely dangerous bluff!"]}, {"IDS": ["acccf62b-c5a4-4d49-beab-4ca184668825"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421580395"], "Names": ["Tokyo Ghoul, Vol. 4 - Tokyo Ghoul 4 (Paperback)"], "Authors": ["Sui Ishida"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Ghouls live among us, the same as normal people in every way - except their craving for human flesh. Ken Kaneki is an ordinary college student until a violent encounter turns him into the first half-human half-ghoul hybrid. Trapped between two worlds, he must survive Ghoul turf wars, learn more about Ghoul society and master his new powers.\n\nKaneki meets Shu Tsukiyama, known as The Gourmet for his interesting and sadistic tastes. And Kaneki learns more about what happened to Rize and what it means to be a One-Eyed Ghoul."]}, {"IDS": ["070ed17f-1fe0-4536-b738-81dd5e94ef2e"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974732111"], "Names": ["Dragon Ball Super, Vol. 16 - Dragon Ball Super 16 (Paperback)"], "Authors": ["Akira Toriyama"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Goku's adventure from the best-selling classic manga Dragon Ball continues in this new series written by Akira Toriyama himself!\n\nEver since Goku became Earth's greatest hero and gathered the seven Dragon Balls to defeat the evil Boo, his life on Earth has grown a little dull. But new threats loom overhead, and Goku and his friends will have to defend the planet once again in this continuation of Akira Toriyama's best-selling series, Dragon Ball!\n\nGranolah is the last of the Cerealians, a people who were all but wiped out by the Saiyans and Freeza's army many years ago. When he learns that the long-lost twin to the Dragon Ball that the old Namekian Monaito keeps in their home has been found, Granolah steals it and makes a wish that will allow him to start his quest for revenge against the Saiyans-to become the strongest being in the whole universe! Meanwhile, the Heeters work behind the scenes to put Granolah out of his misery once and for all...by enlisting Goku and Vegeta's help!"]}, {"IDS": ["b334aae6-c588-437b-bdfe-fa6e805d9e88"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974727155"], "Names": ["My Hero Academia, Vol. 30 - My Hero Academia 30 (Paperback)"], "Authors": ["Kohei Horikoshi"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Midoriya inherits the superpower of the world's greatest hero, but greatness won't come easy.\n\nWhat would the world be like if 80 percent of the population manifested superpowers called \"Quirks\"? Heroes and villains would be battling it out everywhere! Being a hero would mean learning to use your power, but where would you go to study? The Hero Academy of course! But what would you do if you were one of the 20 percent who were born Quirkless?\n\nMidoriya and Tomura have finally come to blows and the battle intensifies as Tomura tries to steal One For All. The clash extends into the One For All spirit realm, where the previous users and even All For One join the struggle. While the battle for the ultimate Quirk rages, the other heroes and villains duke it out. Ochaco finds herself taking on Toga, who doesn't want a fight so much as a heart-to-heart? Then, Dabi finally arrives in Jaku City with a shocking revelation..."]}, {"IDS": ["e5dbda89-3537-4c05-8ab2-eac50b8f45b5"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974714803"], "Names": ["Jujutsu Kaisen, Vol. 4 - Jujutsu Kaisen 4 (Paperback)"], "Authors": ["Gege Akutami"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["To gain the power he needs to save his friend from a cursed spirit, Yuji Itadori swallows a piece of a demon, only to find himself caught in the midst of a horrific war of the supernatural!\n\nIn a world where cursed spirits feed on unsuspecting humans, fragments of the legendary and feared demon Ryomen Sukuna have been lost and scattered about. Should any demon consume Sukuna's body parts, the power they gain could destroy the world as we know it. Fortunately, there exists a mysterious school of jujutsu sorcerers who exist to protect the precarious existence of the living from the supernatural!\n\nWhile investigating a strange set of mysterious deaths, Itadori meets Junpei, a troubled kid who is often bullied at school. However, Junpei is also befriended by the culprit behind the bloody incident-Mahito, a mischievous cursed spirit! Mahito sets in motion a devious plan involving Junpei, hoping to ensnare Itadori as well."]}, {"IDS": ["51673cae-a328-4997-93d5-ea96a2a07162"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974700561"], "Names": ["Demon Slayer: Kimetsu no Yaiba, Vol. 5 - Demon Slayer: Kimetsu no Yaiba 5 (Paperback)"], "Authors": ["Koyoharu Gotouge"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Tanjiro sets out on the path of the Demon Slayer to save his sister and avenge his family!\n\nIn Taisho-era Japan, Tanjiro Kamado is a kindhearted boy who makes a living selling charcoal. But his peaceful life is shattered when a demon slaughters his entire family. His little sister Nezuko is the only survivor, but she has been transformed into a demon herself! Tanjiro sets out on a dangerous journey to find a way to return his sister to normal and destroy the demon who ruined his life.\n\nAt Mt. Natagumo, Tanjiro, Zenitsu and Inosuke battle a terrible family of spider demons. Taking on such powerful enemies demands all the skill and luck Tanjiro has as he and his companions fight to rescue Nezuko from the spiders' web. The battle is drawing in other Demon Slayers but not all of them will leave Mt. Natagumo alive...or in one piece!"]}, {"IDS": ["4b06daa6-09eb-4303-a5dc-3b4d6468d763"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781626924673"], "Names": ["The Girl From the Other Side: Siuil, A Run Vol. 1 - The Girl From the Other Side: Siuil, a Run 1 (Paperback)"], "Authors": ["Nagabe"], "Publishers": ["Seven Seas Entertainment, LLC"], "Book_Formats": ["Paperback"], "Descriptions": ["The Girl From the Other Side: Siuil, a Run is an all-new manga series that pulls readers into a magical and enchanting tale about a young girl and her demonic guardian. A haunting story of love and fantastical creatures, The Girl From the Other Side: Siuil, a Run is a gorgeously-illustrated ongoing manga series that will appeal to fans of The Ancient Magus' Bride. Each volume in the series will be released with a beautifully-textured matte finish cover and will include at least one full-colour insert. In a world split between the Inside and the Outside, those living in both realms are told never to cross over to the other side, lest they be cursed. A young girl named Shiva lives on the other side, in a vacant village with a demonic guardian known only as \"Teacher.\" Although the two are forbidden to touch, they seem to share a bond that transcends their disparate appearances. But when Shiva leaves Teacher's care to seek out her grandmother, the secret behind her mysterious living arrangement comes to light."]}, {"IDS": ["b9ac631e-9073-4351-b988-f1187d2023e8"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781975399573"], "Names": ["Toilet-bound Hanako-kun, Vol. 2 (Paperback)"], "Authors": ["AidaIro"], "Publishers": ["Little, Brown & Company"], "Book_Formats": ["Paperback"], "Descriptions": ["Nene Yashiro has made a pact with \"Hanako-san of the Toilet,\" aka Hanako-kun, to hold off the curse that has been placed on her. To rescue her friend from the clutches of one of the school's infamous Seven Mysteries, she and Hanako-kun infiltrate the Misaki Stairs. The second volume of the retro horror romantic comedy about an occult girl and an inhuman supernatural boy is finally in print!"]}, {"IDS": ["b722e68d-4116-4ff0-a796-59c500f0700a"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781648279195"], "Names": ["Grandmaster of Demonic Cultivation: Mo Dao Zu Shi (Novel) Vol. 1 (Paperback)"], "Authors": ["Mo Xiang Tong Xiu"], "Publishers": ["Seven Seas Entertainment, LLC"], "Book_Formats": ["Paperback"], "Descriptions": ["Also known as MDZS, the blockbuster danmei/Boys' Love novels from China that inspired comics, animation, and the live-action series The Untamed! This historical fantasy tale of two powerful men who find each other through life and death is now in English, for the very first time!\nWei Wuxian was once one of the most powerful men of his generation, a talented and clever young cultivator who harnessed martial arts and spirituality into powerful abilities. But when the horrors of war led him to seek more power through demonic cultivation, the world's respect for his abilities turned to fear, and his death was celebrated throughout the land. Years later, he awakens in the body of an aggrieved young man who sacrifices his soul so that Wei Wuxian can exact revenge on his behalf.\nThough granted a second life, Wei Wuxian is not free from his first, nor the mysteries that appear before him now. Yet this time, he'll face it all with the righteous and esteemed Lan Wangji at his side, another powerful cultivator whose unwavering dedication and shared memories of their past will help shine a light on the dark truths that surround them. This xianxia fantasy tale built around the romanticized love between two men (danmei) has spawned a multimedia franchise that has taken the globe by storm.\nThe Seven Seas English-language edition will include exclusive, all-new covers from Jin Fang (jinzillaa), interior illustrations from Marina Privalova (BaoshanKaro), and a translation by Suika (yummysuika) with editor Pengie (pengiesama)."]}, {"IDS": ["eeff8ccb-8f5b-4961-a95a-47c64415815c"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421579153"], "Names": ["Gyo (2-in-1 Deluxe Edition) - Junji Ito (Hardback)"], "Authors": ["Junji Ito"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Hardback"], "Descriptions": ["Something is rotten in Okinawa... The floating smell of death hangs over the island. What is it? A strange, legged fish appears on the scene... So begins Tadashi and Kaori's spiral into the horror and stench of the sea. Here is the creepiest masterpiece of horror manga ever from the creator of Uzumaki, Junji Ito. Hold your breath until all is revealed."]}, {"IDS": ["2c6f6d6f-6442-49d0-9e5b-f8e10ed34393"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974718900"], "Names": ["Sensor - Junji Ito (Hardback)"], "Authors": ["Junji Ito"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Hardback"], "Descriptions": ["Horror master Junji Ito explores a new frontier with a grand cosmic horror tale in which a mysterious woman has her way with the world!\nA woman walks alone at the foot of Mount Sengoku. A man appears, saying he's been waiting for her, and invites her to a nearby village. Surprisingly, the village is covered in hairlike volcanic glass fibers, and all of it shines a bright gold.\nAt night, when the villagers perform their custom of gazing up at the starry sky, countless unidentified flying objects come raining down on them-the opening act for the terror about to occur!"]}, {"IDS": ["a9514a32-af0c-4736-b76a-c18828fcfc22"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781975337247"], "Names": ["Solo Leveling, Vol. 4 (comic) (Paperback)"], "Authors": ["Chugong"], "Publishers": ["Little, Brown & Company"], "Book_Formats": ["Paperback"], "Descriptions": ["With a veritable army at his command, Jinwoo is now ready to take on the Demon's\nCastle-but he's got a meeting with Jinah's teacher to deal with first! When asked to talk\ndown a high school student from a life of being a hunter, Jinwoo figures the fastest way\nwould be to show them the realities of a raid. Little does he know that there's more to\nthis particular gate than meets the eye..."]}, {"IDS": ["94a1b9d4-14ce-46b3-a9f2-787b118a795f"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974707096"], "Names": ["No Longer Human - Junji Ito (Hardback)"], "Authors": ["Junji Ito"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Hardback"], "Descriptions": ["Nothing can surpass the terror of the human psyche.\nMine has been a life of much shame.\nI can't even guess myself what it must be to live the life of a human being.\nPlagued by a maddening anxiety, the terrible disconnect between his own concept of happiness and the joy of the rest of the world, Yozo Oba plays the clown in his dissolute life, holding up a mask for those around him as he spirals ever downward, locked arm-in-arm with death.\nOsamu Dazai's immortal and supposedly autobiographical work of Japanese literature, is perfectly adapted here into a manga by Junji Ito. The imagery wrenches open the text of the novel one line at a time to sublimate Yozo's mental landscape into something even more delicate and grotesque. This is the ultimate in art by Ito, proof that nothing can surpass the terror of the human psyche."]}, {"IDS": ["f0d12a56-c308-47ba-b052-84ba91b081af"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781646513741"], "Names": ["Attack on Titan Omnibus 1 (Vol. 1-3) - Attack on Titan Omnibus 1 (Paperback)"], "Authors": ["Hajime Isayama"], "Publishers": ["Kodansha America, Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["It's never been easier to attack Attack on Titan than with these new, giant-sized 3-in-1 omnibus editions! If you've been waiting for the final anime season to check out the do-or-die shonen adventure that defined a decade, now's your chance. These new books tuck almost 600 pages of manga behind a specially-embossed cover, all in a larger size than the regular version. Includes Vol. 1-3 of Attack on Titan. For eons, humans ruled the natural world. But a century ago, everything changed when the Titans appeared. Giant, grotesque parodies of the human form, these sexless monsters consumed all but a few thousand human beings, who took refuge behind giant walls. Today, the threat of the Titans is a distant memory, and a boy named Eren yearns to explore the world beyond the wall. But what began as a childish dream will become an all-too-real nightmare when a Titan finally knocks a hole in the wall, and humanity is once again on the brink of extinction..."]}, {"IDS": ["07de304f-7518-4801-9ac7-260ed0134d2c"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421586205"], "Names": ["Goodnight Punpun, Vol. 1 - Goodnight Punpun 1 (Paperback)"], "Authors": ["Inio Asano"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Meet Punpun Punyama. He's an average kid in an average town.\n\nHe wants to win a Nobel Prize and save the world.\n\nHe wants to go far away with his true love.\n\nHe wants to find some porn.\n\nBut Punpun's life is about to unravel..."]}, {"IDS": ["574329f1-5f30-4b06-a24d-e57b92611fc2"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974720149"], "Names": ["Jujutsu Kaisen 0 (Paperback)"], "Authors": ["Gege Akutami"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["The prequel to the supernatural exorcist adventure Jujutsu Kaisen!\nIn a world where cursed spirits feed on unsuspecting humans, fragments of the legendary and feared demon Ryomen Sukuna were lost and scattered about. Should any demon consume Sukuna's body parts, the power they gain could destroy the world as we know it. Fortunately, there exists a mysterious school of jujutsu sorcerers who exist to protect the precarious existence of the living from the supernatural!\nYuta Okkotsu is a nervous high school student who is suffering from a serious problem-his childhood friend Rika has turned into a Curse and won't leave him alone. Since Rika is no ordinary Curse, his plight is noticed by Satoru Gojo, a teacher at Jujutsu High, a school where fledgling exorcists learn how to combat Curses. Gojo convinces Yuta to enroll, but can he learn enough in time to confront the Curse that haunts him?"]}, {"IDS": ["3b15f435-0f56-4b0e-925a-bb812b0f84b6"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421585659"], "Names": ["One-Punch Man, Vol. 2 - One-Punch Man 2 (Paperback)"], "Authors": ["ONE"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Nothing about Saitama passes the eyeball test when it comes to superheroes, from his lifeless expression to his bald head to his unimpressive physique. However, this average-looking guy has a not-so-average problem - he just can't seem to find an opponent strong enough to take on! He's easily taken out a number of monsters, including a crabby creature, a malicious mosquito girl and a muscly meathead. But his humdrum life takes a drastic turn when he meets Genos - a cyborg who wants to uncover the secret behind his strength!"]}, {"IDS": ["d3e08e86-7035-460c-9c9d-2c1cc0c8ac62"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781975319434"], "Names": ["Solo Leveling, Vol. 1 (manga) (Paperback)"], "Authors": ["Chugong"], "Publishers": ["Little, Brown & Company"], "Book_Formats": ["Paperback"], "Descriptions": ["The official English print publication of the popular Korean webcomic! E-class hunter Jinwoo Sung is the weakest of them all. Looked down on by everyone, he has no money, no abilities to speak of, and no other job prospects. So when his party finds a hidden dungeon, he's determined to use this chance to change his life for the better...but the opportunity he finds is a bit different from what he had in mind!"]}, {"IDS": ["6442bf9b-784c-4870-bde7-29c5b4c4ebc4"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974714810"], "Names": ["Jujutsu Kaisen, Vol. 5 - Jujutsu Kaisen 5 (Paperback)"], "Authors": ["Gege Akutami"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["To gain the power he needs to save his friend from a cursed spirit, Yuji Itadori swallows a piece of a demon, only to find himself caught in the midst of a horrific war of the supernatural!\n\nIn a world where cursed spirits feed on unsuspecting humans, fragments of the legendary and feared demon Ryomen Sukuna have been lost and scattered about. Should any demon consume Sukuna's body parts, the power they gain could destroy the world as we know it. Fortunately, there exists a mysterious school of jujutsu sorcerers who exist to protect the precarious existence of the living from the supernatural!\n\nEveryone's surprised (and not necessarily in a good way) when they find out Itadori is still alive, but there's no time for a heartwarming reunion when Jujutsu High is in the midst of an intense competition with their rivals from Kyoto! But good sportsmanship doesn't seem to be in the cards once the authorities decide to eliminate the Sukuna threat once and for all..."]}, {"IDS": ["7eb9dc61-6a28-4e76-88ea-a4e379997a0e"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974714827"], "Names": ["Jujutsu Kaisen, Vol. 6 - Jujutsu Kaisen 6 (Paperback)"], "Authors": ["Gege Akutami"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["To gain the power he needs to save his friend from a cursed spirit, Yuji Itadori swallows a piece of a demon, only to find himself caught in the midst of a horrific war of the supernatural!\n\nIn a world where cursed spirits feed on unsuspecting humans, fragments of the legendary and feared demon Ryomen Sukuna have been lost and scattered about. Should any demon consume Sukuna's body parts, the power they gain could destroy the world as we know it. Fortunately, there exists a mysterious school of jujutsu sorcerers who exist to protect the precarious existence of the living from the supernatural!\n\nDuring the Goodwill Event, the Kyoto School's authorities order their students to assassinate Itadori. However, Mahito and a horde of special grade curses and curse users complicate matters by attacking the students. The teachers move quickly to counterattack but find themselves cut off by a barrier. Can the students survive this demonic onslaught?!"]}, {"IDS": ["e1f10d9e-3bf3-495b-9218-9ee652c16a66"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9780316552813"], "Names": ["The Case Study of Vanitas, Vol. 1 (Paperback)"], "Authors": ["Jun Mochizuki"], "Publishers": ["Little, Brown & Company"], "Book_Formats": ["Paperback"], "Descriptions": ["Rumors revolving around The Book of Vanitas, a clockwork grimoire of dubious reputation, draw No?, a young vampire in search of a friend's salvation, to Paris. What awaits him in the City of Flowers, however, is not long hours treading the pavement or rifling through dusty bookshops in search of the tome. Instead, his quarry comes to him...in the arms of a man claiming to be a vampire doctor! Thrust into a conflict that threatens the peace between humans and vampires, will No? cast in his lot with the curious and slightly unbalanced Vanitas and his quest to save vampirekind?"]}, {"IDS": ["8c9ce562-6551-4449-bde6-79a0ba5d48a7"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974725137"], "Names": ["Spy x Family, Vol. 6 - Spy x Family 6 (Paperback)"], "Authors": ["Tatsuya Endo"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["An action-packed comedy about a fake family that includes a spy, an assassin and a telepath!\n\nMaster spy Twilight is unparalleled when it comes to going undercover on dangerous missions for the betterment of the world. But when he receives the ultimate assignment-to get married and have a kid-he may finally be in over his head!\n\nTwilight and Nightfall enter an underground tennis tournament, hoping for an opportunity to obtain an intelligence document that threatens to bring the world to the brink of war! But will their mission be compromised by Nightfall's secret crush on Twilight?!"]}, {"IDS": ["9e116751-8f36-438a-ac24-837da0deef17"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781569319307"], "Names": ["Dragon Ball Z, Vol. 1 - Dragon Ball Z 1 (Paperback)"], "Authors": ["Akira Toriyama"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Sci-Fi martial arts action!\n\nAfter years of training and adventure, Goku has become Earth's ultimate warrior. And his son, Gohan, shows even greater promise. But the stakes are increasing as even deadlier enemies threaten the planet. DRAGON BALL Z is the ultimate science fiction-martial arts manga.\n\nSon Goku is the greatest hero on Earth. Five years after defeating the demon king Piccolo, he's grown up and had a family--he's married, and he has a child, Son Gohan. But what is the real reason for Goku's incredible strength? A visitor from outer space arrives bearing terrible news--Goku is an alien, and the visitor, Raditz, is Goku's brother! When Raditz turns out to be a ruthless killer, Goku must fight his incredibly strong brother to save his family and the entire human race. A surprising alliance may be Earth's last hope: Goku will team up with his old enemy Piccolo...archenemies united to save the world!"]}, {"IDS": ["94a42f03-a444-426d-ac7e-0dd1bb2207c0"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781421595481"], "Names": ["Splatoon, Vol. 1 - Splatoon 1 (Paperback)"], "Authors": ["Sankichi Hinodeya"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["Four Inklings who can switch between human and squid forms get caught up in a Splatoon Turf War that launches them into all-new adventures based on the hit Nintendo video game series!\nThe Turf Wars have started in Inkopolis, and the team that inks the most ground will be crowned the winner! Goggles and Team Blue are up for the challenge, despite being ranked lower than the other amazing Inkling competitors. But with some teamwork and a touch of unpredictability, they might have just enough to leave their mark on this tournament!\nAll-new adventures featuring the beloved characters of the hit Nintendo video game!"]}, {"IDS": ["14e669ea-016a-404b-a72d-eedb260cb3fc"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781648279218"], "Names": ["The Scum Villain's Self-Saving System: Vol. 1 (Paperback)"], "Authors": ["Mo Xiang Tong Xiu"], "Publishers": ["Seven Seas Entertainment, LLC"], "Book_Formats": ["Paperback"], "Descriptions": ["The blockbuster danmei/Boys' Love novels from China that inspired the animated Scumbag System series streaming in English!\nThis comedic tale of a man reborn as a villain in a fantasy novel series who ends up romancing the male protagonist is now in English, for the very first time! Half-demon Luo Binghe rose from humble beginnings and a tortured past to become unrivaled in strength and beauty. With his harem of over three hundred wives, and dominion over both the human and demonic realms, he is truly the most powerful protagonist-in a trashy web novel series! At least, that's what Shen Yuan, online alias \"Peerless Cucumber,\" believes as he finishes reading the final chapter in Proud Immortal Demon Way. But when a combination of rage and a poor meal choice leads to his death, Shen Yuan finds himself reborn into the world of the web novel, in the body of Shen Qingqiu-the beautiful but cruel teacher to a young Luo Binghe.\nAlthough as Shen Qingqiu, he now has incredible power and abilities as a cultivator, he's destined to be horrifically punished for crimes against the protagonist, so this new Shen Qingqiu has only one course of action: get into Luo Binghe's good graces before the young man's rise to power. That's the only way he'll escape the awful fate of a true scum villain! This fantasy (xianxia) comedy built around the romanticized love between two men (danmei) was the first series by Mo Xiang Tong Xiu to spur a global multimedia franchise, followed by her later blockbusters Grandmaster of Demonic Cultivation and Heaven Official's Blessing. The Seven Seas English-language edition will include exclusive, all-new covers and interior illustrations from Xiao Tong Kong (Velinxi) and feature a translation by Faelicy (faelicy) & Lily (lily_ocho)."]}, {"IDS": ["11f567d3-70f8-4786-975b-4d0656bf263d"], "Timestamps": ["2022-11-11,12:44:02"], "ISBNS": ["9781974707164"], "Names": ["Komi Can't Communicate, Vol. 5 - Komi Can't Communicate 5 (Paperback)"], "Authors": ["Tomohito Oda"], "Publishers": ["Viz Media, Subs. of Shogakukan Inc"], "Book_Formats": ["Paperback"], "Descriptions": ["The journey to 100 friends begins with a single conversation.\n\nSocially anxious high school student Shoko Komi's greatest dream is to make some friends, but everyone at school mistakes her crippling social anxiety for cool reserve. Luckily she meets Tadano, a timid wallflower who decides to step out of his comfort zone in order to help her achieve her goal of making 100 friends.\n\nKomi's friendship quest just hit its first major obstacle-the green-eyed monster! Tadano and a girl named Onemine have been hanging out a lot lately, and Komi doesn't know how to deal with her sudden flood of jealousy. She can't explain what's wrong, so she ends up spying on them from the shadows. Will her creepy peeping lose her a chance at a new friend and push Tadano away?"]}]